
[
    {
        "Section in BNS":"Sec. 71",
        "Description": "Punishment for Repeat offenders (Sec. 64, 65, 66, 70) \nCognizable offence \npunishable with imprisonment for life which shall mean the remainder of that person's natural life or with death",
        "Section in IPC":"376-E"
    },

    {
        "Section in BNS":"Sec. 72",
        "Description": "Disclosure of identity of victim of certain offences etc. \nCognizable offence \npunishable with imprisonment for 2 Years and fine. \nNote- Earlier Sec. 228A of IPC covers both. Now two separate offences have been made in Sec. 72 & Sec. 73 of BNS",
        "Section in IPC":"S.228A"
    },

    {
        "Section in BNS":"Sec. 73",
        "Description": "Printing of publishing any matter relating to court proceedings without permission \nCognizable offence punishable with imprisonment for 2 years and fine.",
        "Section in IPC":"S.228A"
    },
    
    {
        "Section in BNS":"Sec. 74",
        "Description": "Assault or use of criminal force to woman with intent to outrage her modesty \nCognizable offence. Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment of either description for a term which shall not be less than one year but which may extend to five years, and shall also be liable to fine",
        "Section in IPC":"S.354"
    },
    
    {
        "Section in BNS":"Sec. 75",
        "Description": "Sexual harassment \nCognizable offence punishable with \n(2)  Rigorous imprisonment with 3 years, or with fine, or with both for offence specified in section 75 (1) (i) (ii) (iii) \n(3)  imprisonment with 1 year, or with fine, or with both for offence specified in section 75 (1)(iv)",
        "Section in IPC":"S.354A"
    },
    
    {
        "Section in BNS":"Sec. 76",
        "Description": "Assault or use of criminal force to women with intent to disrobe. \nWhoever (Any Man who) assaults or uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to be naked, shall be punished with imprisonment of either description for a term which shall not be less than three years but which may extend to seven years, and shall also be liable to fine. \nCognizable offence \nNote: This offence has been made gender neutral.",
        "Section in IPC":"S.354B"
    },
    
    {
        "Section in BNS":"Sec. 77",
        "Description": "Voyeurism \nWhoever (Any Man who) watches, or captures the image of a woman engaging in a private act in circumstances where she would usually have the expectation of not being observed either by the perpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be punished on first conviction with imprisonment of either description for a term which shall not be less than one year, but which may extend to three years, and shall also be liable to fine, and be punished on a second or subsequent conviction, with imprisonment of either description for a term which shall not be less than three years, but which may extend to seven years, and shall also be liable to fine. \nCognizable offence \nNote: Now a woman can also be punished. (Gender Neutral)",
        "Section in IPC":"S.354C"
    },
    
    {
        "Section in BNS":"Sec. 78",
        "Description": "Stalking \nCognizable offence \nImprisonment up to 3 years and fine \nIn case of second or subsequent conviction, imprisonment up to 5 years and fine",
        "Section in IPC":"S.354 D"
    },
    
    {
        "Section in BNS":"Sec. 79",
        "Description": "Word gesture or act intended to insult modesty of a woman \nCognizable offence \nImprisonment up to 3 years and fine",
        "Section in IPC":"S.509"
    },
    
    {
        "Section in BNS":"Sec. 80",
        "Description": "Dowry Death \nCognizable offence \nImprisonment for not less than 7 years but which may extend to imprisonment for life",
        "Section in IPC":"S.304-B"
    },
    
    {
        "Section in BNS":"Sec. 81",
        "Description": "Cohabitation caused by a man deceitfully inducing belief of lawful marriage \nNon Cognizable \npunishable with imprisonment for ten years and fine.",
        "Section in IPC":"S.493"
    },
    
    {
        "Section in BNS":"Sec. 82",
        "Description": "Marrying again during lifetime of husband or wife \n(1) Non Cognizable \npunishable with imprisonment for seven years and fine. \n(2) Non Cognizable \npunishable with imprisonment for ten years and fine, if concealed with whom the subsequent marriage is contracted.",
        "Section in IPC":"S.494 \nS.495"
    },
    
    {
        "Section in BNS":"Sec. 83",
        "Description": "Marriage ceremony,fraudulently gone through without lawful marriage \nNon Cognizable \npunishable with imprisonment upto seven years and fine.",
        "Section in IPC":"S.496"
    },
    
    {
        "Section in BNS":"Sec. 84",
        "Description": "Enticing or taking away or detaining with criminal intent a married woman \nNon Cognizable \npunishable with imprisonment for two years, or with fine or with both.",
        "Section in IPC":"S.498"
    },

    {
        "Section in BNS":"Sec. 85",
        "Description": "Husband or relative of husband of a woman subjecting her to cruelty \nCognizable (only on the complaint of the victim or her blood relative or notified public servant) \nPunishable with imprisonment which may extend to three years and with fine.",
        "Section in IPC":"S.498A"
    },

    {
        "Section in BNS":"Sec. 86",
        "Description": "Cruelty (Defined)",
        "Section in IPC":"S.498A"
    },

    {
        "Section in BNS":"Sec. 87",
        "Description": "Kidnapping, abducting or inducing woman to compel her marriage, etc. \nCognizable offence \npunishable with imprisonment for ten years and fine.",
        "Section in IPC":"S.366"
    },

    {
        "Section in BNS":"Sec. 88",
        "Description": "Causing miscarriage \nNon Cognizable \npunishable with imprisonment for three years, or fine or both. If the woman be quick with child, shall be punished with imprisonment which may extend to seven years and with fine.",
        "Section in IPC":"S.312"
    },

    {
        "Section in BNS":"Sec. 89",
        "Description": " Causing miscarriage without woman’s consent \nCognizable \npunishable imprisonment for life or imprisonment for ten years and fine.",
        "Section in IPC":"S.313"
    },

    {
        "Section in BNS":"Sec. 90 \n(1)",
        "Description": "Death caused by act done with intent to cause miscarriage \nCognizable \n(1)  punishable with imprisonment for ten years and fine \n(2)  if without consent, punishable imprisonment for life or as above.",
        "Section in IPC":"S.314"
    },

    {
        "Section in BNS":"Sec. 91",
        "Description": "Act done with intent to prevent child being born alive or to cause to die after birth \nCognizable \npunishable with imprisonment for ten years or with fine or with both.",
        "Section in IPC":"S. 315"
    },

    {
        "Section in BNS":"Sec. 92",
        "Description": "Causing death of quick unborn child by act amounting to culpable homicide \nCognizable \npunishable with imprisonment for ten years and fine.",
        "Section in IPC":"S. 316"
    },

    {
        "Section in BNS":"Sec. 94",
        "Description": "Concealment of birth by secret disposal of dead body \nCognizable \npunishable with imprisonment for two years, or with fine, or with both",
        "Section in IPC":"S. 318"
    },

    {
        "Section in BNS":"Sec. 95",
        "Description": "Hiring, employing or engaging a child to commit an offence \nWhoever hires, employs or engages any child to commit an offence shall be punished with imprisonment of either description which shall not be less than three years but which may extend to ten years, and with fine; and if the offence be committed shall also be punished with the punishment provided for that offence as if the offence has been committed by such person himself. \nExplanation. —Hiring, employing, engaging or using a child forsexual exploitation or pornography is covered within the meaning of this section. \nCognizable offence",
        "Section in IPC":"New offence"
    },

    {
        "Section in BNS":"Sec. 96",
        "Description": "Procuration of child \nWhoever, by any means whatsoever, induces any child (earlier any minor girl under the age of 18 years) to go from any place or to do any act with intent that such child may be, or knowing that it is likely that such child will be, forced or seduced to illicit intercourse with another person shall be punishable with imprisonment which may extend to ten years, and shall also be liable to fine. \nCognizable offence \npunishable with imprisonment for ten years and fine. \nNote: Minor girl has been replaced with Child to made the offence gender neutral",
        "Section in IPC":"S. 366A"
    },

    {
        "Section in BNS":"Sec. 97",
        "Description": "Kidnapping or abducting child under ten years of age with intent to steal from its person \nCognizable offence \npunishable with imprisonment for seven years and with fine.",
        "Section in IPC":"S. 369"
    },

    {
        "Section in BNS":"Sec. 98",
        "Description": "Selling child for purposes of prostitution, etc \nWhoever sells, lets to hire, or otherwise disposes of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, or knowing it to be likely that such child will at any age be employed or used for any such purpose, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine. \nCognizable offence \npunishable with imprisonment of either description for a term which may extend to ten years and shall also be liable to fine \nNote: Any person under the age of eighteen years has been replaced with Child",
        "Section in IPC":"S. 372"
    },

    {
        "Section in BNS":"Sec. 99",
        "Description": "Buying child for purpose of prostitution, etc \nWhoever buys, hires or otherwise obtains possession of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, or knowing it to be likely that such child will at any age be employed or used for any such purpose, shall be punished with imprisonment of either description for a term which shall not be less than seven years but which may extend to fourteen years, and shall also be liable to fine. \nCognizable offence \npunishable with imprisonment of either description for a term which shall not be less than seven years but may extend to fourteen years and shall also be liable to fine \nNote: Minor has been replaced with Child ",
        "Section in IPC":"S. 373"
    },

    {
        "Section in BNS":"Sec.100",
        "Description": "Culpable homicide",
        "Section in IPC":"S.299"
    },
    
    {
        "Section in BNS":"Sec.101",
        "Description": "Murder (Definition) \nExcept in the cases here in after excepted, culpable homicide is murder, \n(a)  If the act by which the death is caused is done with the intention of causing death; or \n(b)  If the act by which the death is caused is done with the intention of causing such bodily injury as the offender knows to be likely to cause the death of the person to whom the harm is caused; or \n(c)  If the act by which the death is caused is done with the intention of causing bodily injury to any person and the bodily injury intended to be inflicted is sufficient in the ordinary course of nature to cause death; or \n(d)  If the person committing the act by which the death is caused, knows that it is so imminently dangerous that it must, in all probability, cause death, or such bodily injury as is likely to cause death, and commits such act without any excuse for incurring the risk of causing death or such injury as aforesaid. \nNote: (May read illustrations and exceptions thoroughly given in the Sanhita)",
        "Section in IPC":"S.300"
    },
    
    {
        "Section in BNS":" Sec.102",
        "Description": "Culpable homicide by causing death of person other than person whose death was intended",
        "Section in IPC":"S.301"
    },
    
    {
        "Section in BNS":"Sec.103 \n(1)",
        "Description": "Punishment for murder \nCognizable punishable with death or imprisonment for life and fine.",
        "Section in IPC":"S.302"
    },
    
    {
        "Section in BNS":"Sec.103 \n(2)",
        "Description": "Punishment for murder, when a group of five or more persons acting in concert commits murder on the ground of race, caste or community, sex, place of birth, language, personal belief or any other similar ground each member of such group shall be punished with death or with imprisonment for life, and shall also be liable to fine. \nCognizable offence \npunishable with death or with imprisonment for life and fine. \nComment :- Special categories have been created within the offence for murder and grievous hurt by group of five or more persons’ on the grounds of the victim’s social profile, particularly his ‘race’, caste or community, sex, place of birth, language, personal belief and any other grounds without specifically using the belief and any other grounds without specifically using the term ‘mob lynching’ for which a punishment of a minimum seven years of mandatory imprisonment has been provided. In case of causing ‘grievous hurt’ by group of five or more persons on the ground race, caste or community etc. the punishment is 7 years and fine.",
        "Section in IPC":"New \nProvision"
    },
    
    {
        "Section in BNS":"Sec.104",
        "Description": "Punishment for murder by life convict \nWhoever, being under sentence of imprisonment for life, commits murder, shall be punished with death or with imprisonment for life, which shall mean the remainder of that person’s natural life. \nCognizable offence \npunishable with death or with imprisonment for life, which shall mean that the remainder of that person’s natural life. \nNote: Provision of life imprisonment also included",
        "Section in IPC":"S.303"
    },
    
    {
        "Section in BNS":"Sec.105",
        "Description": "Punishment for culpable homicide not amounting to murder \nWhoever commits culpable homicide not amounting to murder, shall be punished with imprisonment for life, or imprisonment of either description for a term which shall not be less than five years but which may extend to ten years, and shall also be liable to fine, if the act by which the death is caused is done with the intention of causing death, or of causing such bodily injury as is likely to cause death; or with Imprisonment of either description for a term which may extend to ten years and with fine, if the act is done with the knowledge that it is likely to cause death, but without any intention to cause death, or to cause such bodily injury as is likely to cause death. \nCognizable offence \npunishable with imprisonment for life, or imprisonment for not less than five years but which may extend to ten years and fine. If act be done with knowledge, than imprisonment for ten years and fine. \nNote: Minimum Punishment of 5 years provided",
        "Section in IPC":"S.304"
    },
    
    {
        "Section in BNS":" Sec.106 \n(1)",
        "Description": "Causing death by negligence \nWhoever causes death of any person by doing any rash or negligent act not amounting to culpable homicide, shall be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine; and if such act is done by a registered medical practitioner while performing medical procedure, he shall be punished with imprisonment of either description for a term which may extend to two years, and shall also be liable to fine. (Note- No Change for medical negligence) \nCognizable offence \nPunishable with imprisonment for five years and fine \nNote: Punishment of imprisonment enhanced from 2 years to 5 years",
        "Section in IPC":"S.304 A"
    },

        {
            "Section in BNS":"Sec. 71",
            "Description": "Punishment for Repeat offenders (Sec. 64, 65, 66, 70) \nCognizable offence \npunishable with imprisonment for life which shall mean the remainder of that person's natural life or with death",
            "Section in IPC":"376-E"
        },
    
        {
            "Section in BNS":"Sec. 72",
            "Description": "Disclosure of identity of victim of certain offences etc. \nCognizable offence \npunishable with imprisonment for 2 Years and fine. \nNote- Earlier Sec. 228A of IPC covers both. Now two separate offences have been made in Sec. 72 & Sec. 73 of BNS",
            "Section in IPC":"S.228A"
        },
    
        {
            "Section in BNS":"Sec. 73",
            "Description": "Printing of publishing any matter relating to court proceedings without permission \nCognizable offence punishable with imprisonment for 2 years and fine.",
            "Section in IPC":"S.228A"
        },
        
        {
            "Section in BNS":"Sec. 74",
            "Description": "Assault or use of criminal force to woman with intent to outrage her modesty \nCognizable offence. Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment of either description for a term which shall not be less than one year but which may extend to five years, and shall also be liable to fine",
            "Section in IPC":"S.354"
        },
        
        {
            "Section in BNS":"Sec. 75",
            "Description": "Sexual harassment \nCognizable offence punishable with \n(2)  Rigorous imprisonment with 3 years, or with fine, or with both for offence specified in section 75 (1) (i) (ii) (iii) \n(3)  imprisonment with 1 year, or with fine, or with both for offence specified in section 75 (1)(iv)",
            "Section in IPC":"S.354A"
        },
        
        {
            "Section in BNS":"Sec. 76",
            "Description": "Assault or use of criminal force to women with intent to disrobe. \nWhoever (Any Man who) assaults or uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to be naked, shall be punished with imprisonment of either description for a term which shall not be less than three years but which may extend to seven years, and shall also be liable to fine. \nCognizable offence \nNote: This offence has been made gender neutral.",
            "Section in IPC":"S.354B"
        },
        
        {
            "Section in BNS":"Sec. 77",
            "Description": "Voyeurism \nWhoever (Any Man who) watches, or captures the image of a woman engaging in a private act in circumstances where she would usually have the expectation of not being observed either by the perpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be punished on first conviction with imprisonment of either description for a term which shall not be less than one year, but which may extend to three years, and shall also be liable to fine, and be punished on a second or subsequent conviction, with imprisonment of either description for a term which shall not be less than three years, but which may extend to seven years, and shall also be liable to fine. \nCognizable offence \nNote: Now a woman can also be punished. (Gender Neutral)",
            "Section in IPC":"S.354C"
        },
        
        {
            "Section in BNS":"Sec. 78",
            "Description": "Stalking \nCognizable offence \nImprisonment up to 3 years and fine \nIn case of second or subsequent conviction, imprisonment up to 5 years and fine",
            "Section in IPC":"S.354 D"
        },
        
        {
            "Section in BNS":"Sec. 79",
            "Description": "Word gesture or act intended to insult modesty of a woman \nCognizable offence \nImprisonment up to 3 years and fine",
            "Section in IPC":"S.509"
        },
        
        {
            "Section in BNS":"Sec. 80",
            "Description": "Dowry Death \nCognizable offence \nImprisonment for not less than 7 years but which may extend to imprisonment for life",
            "Section in IPC":"S.304-B"
        },
        
        {
            "Section in BNS":"Sec. 81",
            "Description": "Cohabitation caused by a man deceitfully inducing belief of lawful marriage \nNon Cognizable \npunishable with imprisonment for ten years and fine.",
            "Section in IPC":"S.493"
        },
        
        {
            "Section in BNS":"Sec. 82",
            "Description": "Marrying again during lifetime of husband or wife \n(1) Non Cognizable \npunishable with imprisonment for seven years and fine. \n(2) Non Cognizable \npunishable with imprisonment for ten years and fine, if concealed with whom the subsequent marriage is contracted.",
            "Section in IPC":"S.494 \nS.495"
        },
        
        {
            "Section in BNS":"Sec. 83",
            "Description": "Marriage ceremony,fraudulently gone through without lawful marriage \nNon Cognizable \npunishable with imprisonment upto seven years and fine.",
            "Section in IPC":"S.496"
        },
        
        {
            "Section in BNS":"Sec. 84",
            "Description": "Enticing or taking away or detaining with criminal intent a married woman \nNon Cognizable \npunishable with imprisonment for two years, or with fine or with both.",
            "Section in IPC":"S.498"
        },
    
        {
            "Section in BNS":"Sec. 85",
            "Description": "Husband or relative of husband of a woman subjecting her to cruelty \nCognizable (only on the complaint of the victim or her blood relative or notified public servant) \nPunishable with imprisonment which may extend to three years and with fine.",
            "Section in IPC":"S.498A"
        },
    
        {
            "Section in BNS":"Sec. 86",
            "Description": "Cruelty (Defined)",
            "Section in IPC":"S.498A"
        },
    
        {
            "Section in BNS":"Sec. 87",
            "Description": "Kidnapping, abducting or inducing woman to compel her marriage, etc. \nCognizable offence \npunishable with imprisonment for ten years and fine.",
            "Section in IPC":"S.366"
        },
    
        {
            "Section in BNS":"Sec. 88",
            "Description": "Causing miscarriage \nNon Cognizable \npunishable with imprisonment for three years, or fine or both. If the woman be quick with child, shall be punished with imprisonment which may extend to seven years and with fine.",
            "Section in IPC":"S.312"
        },
    
        {
            "Section in BNS":"Sec. 89",
            "Description": " Causing miscarriage without woman’s consent \nCognizable \npunishable imprisonment for life or imprisonment for ten years and fine.",
            "Section in IPC":"S.313"
        },
    
        {
            "Section in BNS":"Sec. 90 \n(1)",
            "Description": "Death caused by act done with intent to cause miscarriage \nCognizable \n(1)  punishable with imprisonment for ten years and fine \n(2)  if without consent, punishable imprisonment for life or as above.",
            "Section in IPC":"S.314"
        },
    
        {
            "Section in BNS":"Sec. 91",
            "Description": "Act done with intent to prevent child being born alive or to cause to die after birth \nCognizable \npunishable with imprisonment for ten years or with fine or with both.",
            "Section in IPC":"S. 315"
        },
    
        {
            "Section in BNS":"Sec. 92",
            "Description": "Causing death of quick unborn child by act amounting to culpable homicide \nCognizable \npunishable with imprisonment for ten years and fine.",
            "Section in IPC":"S. 316"
        },
    
        {
            "Section in BNS":"Sec. 94",
            "Description": "Concealment of birth by secret disposal of dead body \nCognizable \npunishable with imprisonment for two years, or with fine, or with both",
            "Section in IPC":"S. 318"
        },
    
        {
            "Section in BNS":"Sec. 95",
            "Description": "Hiring, employing or engaging a child to commit an offence \nWhoever hires, employs or engages any child to commit an offence shall be punished with imprisonment of either description which shall not be less than three years but which may extend to ten years, and with fine; and if the offence be committed shall also be punished with the punishment provided for that offence as if the offence has been committed by such person himself. \nExplanation. —Hiring, employing, engaging or using a child forsexual exploitation or pornography is covered within the meaning of this section. \nCognizable offence",
            "Section in IPC":"New offence"
        },
    
        {
            "Section in BNS":"Sec. 96",
            "Description": "Procuration of child \nWhoever, by any means whatsoever, induces any child (earlier any minor girl under the age of 18 years) to go from any place or to do any act with intent that such child may be, or knowing that it is likely that such child will be, forced or seduced to illicit intercourse with another person shall be punishable with imprisonment which may extend to ten years, and shall also be liable to fine. \nCognizable offence \npunishable with imprisonment for ten years and fine. \nNote: Minor girl has been replaced with Child to made the offence gender neutral",
            "Section in IPC":"S. 366A"
        },
    
        {
            "Section in BNS":"Sec. 97",
            "Description": "Kidnapping or abducting child under ten years of age with intent to steal from its person \nCognizable offence \npunishable with imprisonment for seven years and with fine.",
            "Section in IPC":"S. 369"
        },
    
        {
            "Section in BNS":"Sec. 98",
            "Description": "Selling child for purposes of prostitution, etc \nWhoever sells, lets to hire, or otherwise disposes of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, or knowing it to be likely that such child will at any age be employed or used for any such purpose, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine. \nCognizable offence \npunishable with imprisonment of either description for a term which may extend to ten years and shall also be liable to fine \nNote: Any person under the age of eighteen years has been replaced with Child",
            "Section in IPC":"S. 372"
        },
    
        {
            "Section in BNS":"Sec. 99",
            "Description": "Buying child for purpose of prostitution, etc \nWhoever buys, hires or otherwise obtains possession of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, or knowing it to be likely that such child will at any age be employed or used for any such purpose, shall be punished with imprisonment of either description for a term which shall not be less than seven years but which may extend to fourteen years, and shall also be liable to fine. \nCognizable offence \npunishable with imprisonment of either description for a term which shall not be less than seven years but may extend to fourteen years and shall also be liable to fine \nNote: Minor has been replaced with Child ",
            "Section in IPC":"S. 373"
        },
    
        {
            "Section in BNS":"Sec.100",
            "Description": "Culpable homicide",
            "Section in IPC":"S.299"
        },
        
        {
            "Section in BNS":"Sec.101",
            "Description": "Murder (Definition) \nExcept in the cases here in after excepted, culpable homicide is murder, \n(a)  If the act by which the death is caused is done with the intention of causing death; or \n(b)  If the act by which the death is caused is done with the intention of causing such bodily injury as the offender knows to be likely to cause the death of the person to whom the harm is caused; or \n(c)  If the act by which the death is caused is done with the intention of causing bodily injury to any person and the bodily injury intended to be inflicted is sufficient in the ordinary course of nature to cause death; or \n(d)  If the person committing the act by which the death is caused, knows that it is so imminently dangerous that it must, in all probability, cause death, or such bodily injury as is likely to cause death, and commits such act without any excuse for incurring the risk of causing death or such injury as aforesaid. \nNote: (May read illustrations and exceptions thoroughly given in the Sanhita)",
            "Section in IPC":"S.300"
        },
        
        {
            "Section in BNS":" Sec.102",
            "Description": "Culpable homicide by causing death of person other than person whose death was intended",
            "Section in IPC":"S.301"
        },
        
        {
            "Section in BNS":"Sec.103 \n(1)",
            "Description": "Punishment for murder \nCognizable punishable with death or imprisonment for life and fine.",
            "Section in IPC":"S.302"
        },
        
        {
            "Section in BNS":"Sec.103 \n(2)",
            "Description": "Punishment for murder, when a group of five or more persons acting in concert commits murder on the ground of race, caste or community, sex, place of birth, language, personal belief or any other similar ground each member of such group shall be punished with death or with imprisonment for life, and shall also be liable to fine. \nCognizable offence \npunishable with death or with imprisonment for life and fine. \nComment :- Special categories have been created within the offence for murder and grievous hurt by group of five or more persons’ on the grounds of the victim’s social profile, particularly his ‘race’, caste or community, sex, place of birth, language, personal belief and any other grounds without specifically using the belief and any other grounds without specifically using the term ‘mob lynching’ for which a punishment of a minimum seven years of mandatory imprisonment has been provided. In case of causing ‘grievous hurt’ by group of five or more persons on the ground race, caste or community etc. the punishment is 7 years and fine.",
            "Section in IPC":"New \nProvision"
        },
        
        {
            "Section in BNS":"Sec.104",
            "Description": "Punishment for murder by life convict \nWhoever, being under sentence of imprisonment for life, commits murder, shall be punished with death or with imprisonment for life, which shall mean the remainder of that person’s natural life. \nCognizable offence \npunishable with death or with imprisonment for life, which shall mean that the remainder of that person’s natural life. \nNote: Provision of life imprisonment also included",
            "Section in IPC":"S.303"
        },
        
        {
            "Section in BNS":"Sec.105",
            "Description": "Punishment for culpable homicide not amounting to murder \nWhoever commits culpable homicide not amounting to murder, shall be punished with imprisonment for life, or imprisonment of either description for a term which shall not be less than five years but which may extend to ten years, and shall also be liable to fine, if the act by which the death is caused is done with the intention of causing death, or of causing such bodily injury as is likely to cause death; or with Imprisonment of either description for a term which may extend to ten years and with fine, if the act is done with the knowledge that it is likely to cause death, but without any intention to cause death, or to cause such bodily injury as is likely to cause death. \nCognizable offence \npunishable with imprisonment for life, or imprisonment for not less than five years but which may extend to ten years and fine. If act be done with knowledge, than imprisonment for ten years and fine. \nNote: Minimum Punishment of 5 years provided",
            "Section in IPC":"S.304"
        },
        
        {
            "Section in BNS":" Sec.106 \n(1)",
            "Description": "Causing death by negligence \nWhoever causes death of any person by doing any rash or negligent act not amounting to culpable homicide, shall be punished with imprisonment of either description for a term which may extend to five years, and shall also be liable to fine; and if such act is done by a registered medical practitioner while performing medical procedure, he shall be punished with imprisonment of either description for a term which may extend to two years, and shall also be liable to fine. (Note- No Change for medical negligence) \nCognizable offence \nPunishable with imprisonment for five years and fine \nNote: Punishment of imprisonment enhanced from 2 years to 5 years",
            "Section in IPC":"S.304 A"
        },

        
    {
        "Section in BNS":" Sec.106 (2)",
        "Description": " Punishment for not reporting of death caused by rash or negligent driving of vehicle and escapes from the spot.\nWhoever causes death of any person by rash and negligent driving of vehicle not amounting to culpable homicide, and escapes without reporting it to a police officer or a Magistrate soon after the incident, shall be punished with imprisonment of either description of a term which may extend to ten years, and shall also be liable to fine.",
        "Section in IPC":" New Provision"
    },

    {
        "Section in BNS":" Sec.107",
        "Description": "Abetment of suicide of child or person of unsound mind\nCognizable offence\npunishable with death, imprisonment for life, or imprisonment for ten years and fine.",
        "Section in IPC":" S.305"
    },

    {
        "Section in BNS":"Sec.108",
        "Description": "Abetment of suicide\nCognizable offence\npunishable with imprisonment for ten years and fine. ",
        "Section in IPC":"S.306"
    },

    {
        "Section in BNS":" Sec.109",
        "Description": " Attempt to murder\n(1)  punishable with Imprisonment for ten years and fine. If such act causes hurt to any person than with imprisonment for life, or as above.\n(2)  In case f life convict, he may, if hurt is cause, be punished with death or with imprisonment for life, which shall mean the remainder of that person’s natural life.\nCognizable offence\npunishable with Imprisonment for death or imprisonment for life which shall mean the remainder of that person’s natural life.  Note: Punishment Increased",
        "Section in IPC":" S.307"
    },

    {
        "Section in BNS":"Sec.110",
        "Description": "Attempt to commit culpable homicide\nCognizable offence\npunishable with Imprisonment of either description which may extend to three years, or with fine or with both if hurt is caused, than imprisonment which may extend to seven years or with fine or with both.",
        "Section in IPC":"S.308"
    },

    {
        "Section in BNS":"Sec.111",
        "Description": " Organized crime\n(1)  Any continuing unlawful activity including kidnapping, robbery, vehicle theft, extortion, land grabbing, contract killing, economic offence, cybercrimes, trafficking of persons, drugs, weapons or illicit goods or services, human trafficking for prostitution or ransom, by any person or a group of persons acting in concert, singly or jointly, either as a member of an organised crime syndicate or on behalf of such syndicate, by use of violence, threat of violence, intimidation, coercion, or by any other unlawful means to obtain direct or indirect material benefit including a financial benefit, shall constitute organised crime.\n The meaning of “organised crime syndicate” “continuing unlawful activity” and 'Economic offence' has been given in the Explanation. Also the punishment is given in sub-section (2) to sub- section (7) of this section.\n Cognizable and punishable with\n (2)(a)  Death or imprisonment for life and fine not less than ten lakh rupees.\n (2)(b)  For not less than five years but which may extend to imprisonment for life and fine of not less than five lakh rupees.\n (3)  For not less than five years but which may extend to imprisonment for life and fine of not less than five lakh rupees.\n (4)  For not less than five years but which may extend to imprisonment for life and fine of not less than five lakh rupees.\n (5)  For notless than three years but which may extend to imprisonment for life and fine of not less than five lakh rupees.\n (6)  For not less than three years but which may extend to imprisonment for life and fine of not less than two lakh rupees.\n (7)  For not less than three years but which may extend to imprisonment for ten years and fine of rupees not less than one lakh rupees.\n ",
        "Section in IPC":" New Provision"
    },

    {
        "Section in BNS":" Sec.112",
        "Description": "Petty organised crime\n (1)  Whoever, being a member of a group or gang, either singly or jointly, commits any act of theft, snatching, cheating, unauthorised selling of tickets, unauthorised betting or gambling, selling of  public examination question papers or any other similar criminal act, is said to commit petty organised crime.\n Explanation.— For the purposes of this sub-section “theft” includes trick theft, theft from vehicle, dwelling house or business premises, cargo theft, pick pocketing, theft through card skimming, shoplifting and theft of Automated Teller Machine.\n (2)  Whoever commits any petty organised crime shall be punished with imprisonment for a term which shall not be less than one year but which may extend to seven years,and shall also be liable to fine.\nCognizable offence",
        "Section in IPC":" New Provision"
    },

    {
        "Section in BNS":"Sec.113",
        "Description": "Terrorist act\n (1)  Whoever does any act with the intent to threaten or likely to threaten the unity, integrity, sovereignty, security, or economic security of India or with the intent to strike terror or likely to strike terror in the people or any section of the people in India or in any foreign country,\n a)  by using bombs, dynamite or other explosive substance or inflammable substance or fire arms or other lethal weapons or poisonous or noxious gases or other chemicals or by any other substance (whether biological, radioactive, nuclear or otherwise) of a hazardous nature or by any other means of whatever nature to cause or likely to cause,—\n   i)     death of, or injury to, any person or persons; or\n   ii)     loss of, or damage to, or destruction of, property; or\n   iii)  disruption of any supplies or services essential to the life of the community in India or in any foreign country; or\n   iv)  damage to, the monetary stability of India by way of production or smuggling or circulation of counterfeit Indian paper currency, coin or of any other material; or\n   v)  damage or destruction of any property in India or in a foreign country used or intended to be used for the defence of India or in connection with any other purposes of the Government of India, any State Government or any of their agencies; or\n b)  overawes by means of criminal force or the show of criminal force or attempts to do so or causes death of any public functionary or attempts to cause death of any public functionary; or\n c)  detains, kidnaps or abducts any person and threatening to kill or injure such person or does any other act in order to compel the Government of India, any State Government or the Government of a foreign country or an international or intergovernmental organisation or any other person to do or abstain from doing any act, commit a terrorist act.\n Explanation.—For the purpose of this sub- section,\n  i)     “public functionary” means the constitutional authorities or any other functionary notified in the Official Gazette by the Central Government as public functionary;\n ii)   “counterfeit Indian currency” means the counterfeit currency as may be declared after examination by an authorised or notified forensic authority that such currency imitates or compromises with the key security features of Indian currency.\n (2) Whoever commits a terrorist act shall, —      i)   if such offence has resulted in the death of any person, be punished with death or imprisonment for life, and shall also be liable to fine;\n      ii)   in any other case, be punished with imprisonment for a term which shall not be less than five years but which may extend to imprisonment for life, and shall also be liable to fine.\n (3)  Whoever conspires or attempts to commit, or advocates, abets, advises or incites, directly or knowingly facilitates the commission of a terrorist act or any act preparatory to the commission of a terrorist act, shall be punished with imprisonment for a term which shall not be less than five years but which may extend to imprisonment for life, and shall also be liable to fine. Terrorist act.\n (4)  Whoever organises or causes to be organised any camp or camps for imparting training in terrorist act, or recruits or causes to be recruited any person or persons for commission of a terrorist act, shall be punished with imprisonment for a term which shall not be less than five years but which may extend to imprisonment for life, and shall also be liable to fine.\n (5)  Any person who is a member of an organisation which is involved in terrorist act, shall be punished with imprisonment for a term which may extend to imprisonment for life, and shall also be liable to fine.\n (6)  Whoever voluntarily harbours or conceals, or attempts to harbour or conceal any person knowing that such person has committed a terrorist act shall be punished with imprisonment for a term which shall not be less than three years but which may extend to imprisonment for life, and shall also be liable to fine: Provided that this sub-section shall not apply to any case in which the harbour or concealment is by the spouse of the offender.\n (7)  Whoever knowingly possesses any property derived or obtained from commission of any terrorist act or acquired through the commission of any terrorist act shall be punished with imprisonment for a term which may extend to imprisonment for life, and shall also be liable to fine.\n Explanation.—For the removal of doubts, it is hereby declared that the officer not below the rank of Superintendent of Police shall decide whether to register the case under this section or under the Unlawful Activities (Prevention) Act, 1967.\n Cognizable and punishable with\n (2)(a)  For death or imprisonment for life and fine.\n (2)(b)  For not less than five years but which may extend to imprisonment for life and fine.\n (3)  For not less than five years but which may extend to imprisonment for life and fine.\n (4)  For not less than five years but which may extend to imprisonment for life and fine.\n (5) For life and fine.\n (6)  For not less than three years but which may extend to imprisonment for life and fine.\n (7) For life and fine.",
        "Section in IPC":" New Provision"
    },

    {
        "Section in BNS":" Sec.114",
        "Description": "Hurt",
        "Section in IPC":"S.319"
    },

    {
        "Section in BNS":"Sec.115",
        "Description": " Voluntarily causing hurt\nNon-Cognizable\n Punishable with Imprisonment for one year or with fine which may extend to ten thousand rupees, or with both.\n Note: Fine increased",
        "Section in IPC":"S.321, S.323"
    },

    {
        "Section in BNS":"Sec.116",
        "Description": "Grievous hurt\n (h)   Any hurt which endangers life or which causes the sufferer to be during the space of fifteen days in severe bodily pain, or unable to follow his ordinary pursuits.\n Note: In section 116 of the BNS, 2023 the number of days provided for the sufferer in severe bodily pain for the purpose of ‘grievous hurt’ has been reduced from '20 days' to '15 days'. It is done keeping in view the advancement in the medical treatment which provides quicker recovery.",
        "Section in IPC":" S.320"
    },

    {
        "Section in BNS":"Sec.117",
        "Description": "Voluntarily causing grievous hurt\n Cognizable offence\n (2)  punishable with Imprisonment for seven years and with fine.\n (3)  Grievous hurt causing permanent disability or persistent vegetative state\n Punishment enhanced from 07 years to rigorous imprisonment for a term which shall not less than ten years but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life.\n (4) Hurt caused by a mob\n When a group of five or more persons acting in concert, causes grievous hurt to a person on the ground of his race, caste or community, sex, place of birth, language, personal belief or any other similar ground, each member of such group shall be guilty of the offence of causing grievous hurt, and shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
        "Section in IPC":" S.322, S.325, New Provision, New Provision"
    },

    {
        "Section in BNS":" Sec.118",
        "Description": "Voluntarily causing hurt or grievous hurt by dangerous weapons or means\n (1)  Cognizable punishable with Imprisonment for three years, or fine of twenty thousand rupees, or both.\n (2)  Cognizable punishable with Imprisonment for life, or imprisonment for not less than one year but which may extend to ten years and with fine.\n Note: Fine increased",
        "Section in IPC":"S.324,S.326"
    },

    {
        "Section in BNS":"Sec.119",
        "Description": "Voluntarily causing hurt or grievous hurt to extort property or to constrain to an illegal act.\n (1)  Causing hurt for the purpose of extorting from the sufferer, or from any person interested in the sufferer, any property or valuable security, or of constraining the sufferer or any person interested in such sufferer to do anything which is illegal or which may facilitate the commission of an offence shall be punished with imprisonment of either description for a term which may extend to ten years and fine.\n (2)  Punishable with Imprisonment for life, or imprisonment for ten years and fine in cases other than in (1) above.\n Cognizable offence",
        "Section in IPC":" S.327 ,S. 329"
    },

    {
        "Section in BNS":"Sec.120",
        "Description": "Voluntarily causing hurt or grievous hurt to extort confession, or to compel restoration of property\n Cognizable offence\n (1)  punishable with imprisonment for seven years and fine for voluntarily causing hurt.\n (2)  punishable with imprisonment for ten years and fine for voluntarily causing grievous hurt.",
        "Section in IPC":"S.330 ,S.331"
    },

    {
        "Section in BNS":"Sec.121",
        "Description": "Voluntarily causing hurt or grievous hurt to deter public servant from his duty\n (1)  punishable with imprisonment for five years, or fine or both for voluntarily causing hurt.\n (2)  punishable with imprisonment for not less than one year, or imprisonment for ten years and fine for voluntarily causing grievous hurt.\n Cognizable offence\n Note: Punishment Increased",
        "Section in IPC":"S.332- 333"
    },

    {
        "Section in BNS":"Sec.122",
        "Description": "Voluntarily causing hurt or grievous hurt on provocation.\n (1)  Non-Cognizable punishable with imprisonment for one month, or fine of five thousand rupees, or both for voluntarily causing hurt.\n (2)  Cognizable punishable with imprisonment for five years, or fine of ten thousand rupees, or both for voluntarily causing grievous hurt.\n Note: Punishment & Fine increased",
        "Section in IPC":" S.334 - S.335"
    },

    {
        "Section in BNS":"Sec.123",
        "Description": " Causing hurt by means of poison, etc., with intent to commit an offence\n Cognizable offence\n punishable with imprisonment for ten years and with fine.",
        "Section in IPC":"S.328"
    },

    {
        "Section in BNS":"Sec.124",
        "Description": " Voluntarily causing grievous hurt by use of acid, etc.\n Cognizable offence\n (1)  punishable with imprisonment for not less than ten years but which may extend to imprisonment for life and fine for voluntarily causing grievous hurt.\n (2)   punishable with imprisonment for five years, but which may extend to seven years and fine for voluntarily throwing or attempting to throw acid.",
        "Section in IPC":" S.326 A, S.326 B"
    },

    
    {
        "Section in BNS": "Sec. 125",
        "Description": "Act endangering life or personal safety of others\nCognizable\nPunishable with imprisonment for three months, or fine of two thousand rupees, or both. \n(a) If hurt is caused, imprisonment for six months, or fine of five thousand rupees, or both.\n(b) If grievous hurt is caused, imprisonment for three years, or fine of ten thousand rupees, or both.\nNote: Punishment & fine increased",
        "Section in IPC": "S. 336-S. 338"
    },

    {
        "Section in BNS":"Sec. 126",
        "Description": "Wrongful restraint\nCognizable offence\nPunishable with simple imprisonment for one month, or fine of five thousand rupees, or with both. \n Note: Fine increased",
        "Section in IPC": "S. 339,S. 341"
    },

    {
        "Section in BNS":"Sec. 127",
        "Description": " Wrongful confinement\n Cognizable offence\n(2)  Punishable with imprisonment for one year, or fine of five thousand rupees, or both.\n(3)  If confined for three or more days, punishable with imprisonment for three years, or fine of ten thousand rupees, or both.\n(4)  If confined for ten or more days, punishable with imprisonment for five years, or fine of ten thousand rupees.\n(5)  If a writ has been issued for his liberation than with imprisonment for two years, in addition to any term of imprisonment under any other section and fine.\n(6)  If confined in secrete, with imprisonment for three years, in addition to other punishment for which he is liable to and fine.\n(7)  If confined for extorting property etc, punishable with imprisonment for three years and fine.\n(8)  If confined for extorting confession etc, punishable with imprisonment for three years and fine. \n Note: Punishment & fine increased",
        "Section in IPC":"S. 340,S. 342-S. 348"
    },

    {
        "Section in BNS":"Sec. 128",
        "Description": "Force",
        "Section in IPC":"S. 349"
    },

    {
        "Section in BNS":"Sec. 129",
        "Description": "Criminal force",
        "Section in IPC":"S. 350"
    },

    {
        "Section in BNS":"Sec. 130",
        "Description": "Assault",
        "Section in IPC":"S. 351"
    },

    {
        "Section in BNS":"Sec. 131",
        "Description": "Punishment for assault or criminal force otherwise than on grave provocation\n Non-cognizable \nPunishable with imprisonment for three months, or fine of one thousand rupees, or both\n Note: Fine increased ",
        "Section in IPC":"S. 352"
    },

    {
        "Section in BNS":"Sec. 132",
        "Description": "Assault or criminal force to deter public servant from discharge of his duty\n Cognizable offence \n  punishable with imprisonment for two years, or fine, or both",
        "Section in IPC":"S. 353"
    },

    {
        "Section in BNS":"Sec. 133",
        "Description": "Assault or criminal force with intent to dishonor person, otherwise than on grave provocation\n  Non-cognizable\n punishable with imprisonment for two years, or fine, or both",
        "Section in IPC":"S. 355"
    },

    {
        "Section in BNS":"Sec. 134",
        "Description": "Assault or criminal force in attempt to commit theft of property carried by a person\n Cognizable offence\n  punishable with imprisonment for two years, or fine, or both",
        "Section in IPC":"S. 356"
    },

    {
        "Section in BNS":"Sec. 135",
        "Description": "Assault or criminal force in attempt to wrongfully to confine a person\n Cognizable offence\n punishable with imprisonment for one year, or fine of ive thousand rupees, or both.\nNote:Fine increased",
        "Section in IPC":"S. 357"
    },

    {
         "Section in BNS":"Sec. 136",
        "Description": "Assault or criminal force on grave and sudden provocation \nNon-Cognizable\n punishable with simple imprisonment for one month, or fine of one thousand rupees, or both. Note: Fine increased",
        "Section in IPC":"S. 358"
    },

    {
        "Section in BNS":"Sec. 137",
        "Description": " Kidnapping\nCognizable offence\npunishable with imprisonment for seven years and fine.",
        "Section in IPC":"S. 359-S. 361,S. 363" 
    },

    {
        "Section in BNS":"Sec. 138",
        "Description": "Abduction",
        "Section in IPC":"S. 362"
    },

    {
        "Section in BNS":"Sec. 139",
        "Description": " Kidnapping or maiming a child for purposes of begging \n Cognizable offence\n (1)  If kidnapping is for begging, punishable with rigorous imprisonment not less than ten years but which may extend to imprisonment for life, and fine.\n(2)  If kidnapping for maiming and begging, punishable with imprisonment not be less than 20 years which may extend to remainder of that person’s natural life, and fine.",
        "Section in IPC":"S. 363 A"
    },

    {
        "Section in BNS":"Sec. 140",
        "Description": " Kidnapping or abducting in order to murder or for ransom etc.\n Cognizable offence\n (1)  If for murder, punishable with imprisonment life, or rigorous imprisonment for ten years, and fine.\n (2)  If for ransom etc. punishable with death, or imprisonment for life and fine.\n(3)  If for secretly or wrongfully confining, punishable with seven years and fine.(4)  If for grievous hurt, slavery etc. punishable with imprisonment for ten years and fine.",
        "Section in IPC":"S. 364-S. 365,S. 367" 
    },

    {
        "Section in BNS":"Sec. 141",
        "Description": " Importation of girl or boy from foreign country\n The offence relating to importation of a person from foreign country has been made gender neutral to cover both boys and girls. It will protect the minor boys and girls from being used for the purposes of forced or seduced illicit intercourse.\n Cognizable offence\npunishable with imprisonment for ten years and fine.",
        "Section in IPC":"S. 366 B"
    },

    {
        "Section in BNS":"Sec. 142",
        "Description": " Wrongfully concealing or keeping in confinement, kidnapped or abducted person\n Cognizable offence\n punishable with same as punishment for kidnapping or abduction.",
        "Section in IPC":"S. 368"   
    },

    {
        "Section in BNS":"Sec. 143",
        "Description": "Trafficking of person\n  ‘Beggary’ has been introduced as a form of exploitation for trafficking and has been made punishable in this section\nCognizable offence\n (2)  punishable with rigorous imprisonment not less than seven years but which may extend to ten years and fine.\n (3)  Trafficking of more than one person. punishable with rigorous imprisonment for not less than ten years but which may extend to imprisonment for life and fine.\n (4)  Trafficking of a child. punishable with rigorous imprisonment not less than ten years but which may extend to imprisonment for life and fine.\n (5)  Trafficking of more than one child. punishable with rigorous imprisonment not less than fourteen years but which may extend to imprisonment for life and fine.\n (6)    If convicted for trafficking of child on more than one occasion. punishable with imprisonment for life which shall mean the remainder of that person’s natural life and fine.\n (7)  If public servant or police officer is involved in trafficking of child. punishable with imprisonment for life which shall mean the remainder of that person’s natural life and fine.",
        "Section in IPC":"S. 370"
    },

    {
        "Section in BNS":"Sec. 144",
        "Description": " Exploitation of a trafficked person\n Cognizable offence\n (1)  If child has been trafficked, punishable with rigorous imprisonment not less than five years but which may extend to ten years and fine.\n (2)  If any person has been trafficked, punishable with rigorous imprisonment for not less than three years but which may extend to seven years and fine.\n Note: Punishment increased",
        "Section in IPC":"S. 370A" 
    },

    {
        "Section in BNS":"Sec. 145",
        "Description": " Habitual dealing in slaves \nCognizable offence\n punishable with imprisonment for life or either term not exceeding ten years and with fine.",
        "Section in IPC":"S. 371"
    },

    {
        "Section in BNS":"Sec. 146",
        "Description": " Unlawful compulsory labour \nCognizable offence\n punishable with imprisonment for one year, or fine or with both.",
        "Section in IPC":"S. 374"
    },

    {
        "Section in BNS":"Sec. 147",
        "Description": "Waging or attempting to wage war, or abetting waging of war against Government of India\n Cognizable offence\n punishable with death, imprisonment for life and fine.",
        "Section in IPC":"S. 121"
    },

    {
        "Section in BNS":"Sec. 148",
        "Description": "Conspiracy to commit offences punishable by u/s 147 \nCognizable offence\n punishable with imprisonment for life, or imprisonment for ten years and with fine.",
        "Section in IPC":"S. 121A"
    },

    {
        "Section in BNS":"Sec. 149",
        "Description": " Collecting arms, etc. , with intention of waging war against government of India\n Cognizable offence\n punishable with imprisonment for life, or either description for a term not exceeding ten years and with fine.",
        "Section in IPC":"S. 122"
    },

    {
        "Section in BNS":"Sec. 150",
        "Description": " Concealing with intent to facilitate design to wage war \nCognizable offence\n punishable with imprisonment of either description for a term not exceeding ten years and with fine.",
        "Section in IPC":"S. 123"
    },

    {
        "Section in BNS":"Sec. 151",
        "Description": " Assaulting President, Governor, etc, with intent to compel or restrain exercise of any lawful power \nCognizable offence\n punishable with imprisonment of either description for a term not exceeding seven years and with fine.",
        "Section in IPC":"S. 124"
    },

    {
        "Section in BNS":"Sec. 152",
        "Description": "Acts endangering sovereignty, unity and integrity of India\n Whoever, purposely or knowingly, by words, either spoken or written, or by signs, or by visible representation, or by electronic communications or by use of financials mean, or otherwise, or excites or attempt to excite, secessions or armed rebellion or subversive activities, or encourages feelings of separatist activities or endangers sovereignty or unity and integrity of India , or indulge in or commits any such act shall be punished.\n Cognizable offence\n punishable with imprisonment for life, or imprisonment which may extend to seven years and with fine.",
        "Section in IPC":"New Provision"
    },

    {
        "Section in BNS":"Sec. 153",
        "Description": "Waging war against foreign state at peace with Government of India\n Cognizable offence\n punishable with imprisonment for life to which fine may be added or with imprisonment of either description for a term which may extend to seven years to which fine may be added or with fine.",
        "Section in IPC":"S. 125"
    },

    {
        "Section in BNS":"Sec. 154",
        "Description": " Depredation on territories of foreign state at peace with Government of India\n Cognizable offence\n punishable with imprisonment for seven years and fine and forfeiture of certain property acquired by such depredation.",
        "Section in IPC":"S. 126"
    },

    {
        "Section in BNS":"Sec. 155",
        "Description": " Receiving property taken by war or depredation mentioned in sections 153 and 154\n Cognizable offence\n punishable with imprisonment which may extend to seven years and with fine and forfeiture of property so received.",
        "Section in IPC":"S. 127"
    },

    {
        "Section in BNS":"Sec. 156",
        "Description": " Public servant voluntarily allowing prisoner of state or war to escape\n Cognizable offence\n punishable with imprisonment for life, or imprisonment which may extend to ten years and with fine.",
        "Section in IPC":"S. 128"
    },

    {
        "Section in BNS":"Sec. 157",
        "Description": "Public servant negligently suffering prisoner to escape \nCognizable offence\n punishable with simple imprisonment which may extend to three years and fine.",
        "Section in IPC":"S. 129"
    },

    {
        "Section in BNS":"Sec. 158",
        "Description": " Aiding escape of, rescuing or harboring such prisoner.\n Cognizable offence\n punishable with imprisonment for life, or imprisonment which may extend to ten years and fine.",
        "Section in IPC":"S. 130"
    },

    {
        "Section in BNS":"Sec. 159",
        "Description": " Abetting mutiny, or attempting to seduce a soldier, sailor or airman from his duty.\n Cognizable offence\n punishable with imprisonment for life, or imprisonment for ten years and fine.",
        "Section in IPC":"S. 131"
    },

    {
        "Section in BNS":"Sec. 160",
        "Description": " Abetment of mutiny, if mutiny is committed in consequence thereof\n Cognizable offence\n punishable with death, or imprisonment for life, or imprisonment which may extend to ten years and fine.",
        "Section in IPC":"S. 132"
    },

    {
        "Section in BNS":"Sec. 161",
        "Description": " Abetment of assault by soldier, sailor or airman on his superior officer, when in execution of his office.\n Cognizable offence\n punishable with imprisonment which may extend to three years and fine.",
        "Section in IPC":"S. 133"
    },

    {
        "Section in BNS":"Sec. 162",
        "Description": " Abetment of such assault, if the assault committed.\n Cognizable offence\n punishable with imprisonment which may extend to seven years and fine.",
        "Section in IPC":"S. 134"
    },

    {
        "Section in BNS":"Sec. 163",
        "Description": "Abetment of desertion of soldier, sailor or airman. \nCognizable offence\n punishable with imprisonment which may extend to two years, or fine or both.",
        "Section in IPC":"S. 135"
    },

    {
        "Section in BNS":"Sec. 164",
        "Description": "Harboring deserter.\n Cognizable offence\n punishable with imprisonment which may extend to two years ,or fine or both.",
        "Section in IPC":"S. 136"
    },

    {
        "Section in BNS":"Sec. 165",
        "Description": "Deserter concealed on board merchant vessel through negligence of master.\n Non Cognizable\n punishable with fine of three thousand rupees.",
        "Section in IPC":"S. 137"
    },

    {
        "Section in BNS":"Sec. 166",
        "Description": " Abetment of act of insubordination by soldier, sailor or airman.\n Cognizable offence\n punishable with imprisonment for two years, or fine or both.",
        "Section in IPC":"S. 138"
    },

    {
        "Section in BNS":"Sec. 167",
        "Description": " Persons subject to certain Acts.\n No person subject to the Airforce Act, Army Act and Navy Act or shall be subject to punishment under this Sanhita for the offences defined in this chapter.",
        "Section in IPC":"S. 139"
    },

    {
        "Section in BNS":"Sec. 168",
        "Description": "Wearing garb or carrying token used by soldier, sailor or airman.\n Cognizable offence\n punishable with imprisonment for three months, or fine of two thousand rupees or both.\n Note: Fine increased",
        "Section in IPC":"S. 140"
    },

    {
        "Section in BNS":"Sec. 169",
        "Description": "Candidate, electoral right defined",
        "Section in IPC":"S. 171 A"
    },

    {
        "Section in BNS":"Sec. 170",
        "Description": "Bribery",
        "Section in IPC":"S. 171 B"
    },

    {
        "Section in BNS":"Sec. 171",
        "Description": "Undue influence at elections",
        "Section in IPC":"S. 171 C"
    },

    {
        "Section in BNS":"Sec. 172",
        "Description": "Personation at elections",
        "Section in IPC":"S. 171 D"
    },

    {
        "Section in BNS":"Sec. 173",
        "Description": " Punishment for bribery \nNon Cognizable\n punishable with imprisonment for one year or fine or both or if treating only, fine only.",
        "Section in IPC":"S. 171 E"
    },

    {
        "Section in BNS":"Sec.174",
        "Description": "Punishment for undue influence or personation at an election. \nNon Cognizable \npunishable with imprisonment for one year or fine or both.",
        "Section in IPC":"S.171F"
    },

    {
        "Section in BNS":"Sec.175",
        "Description": "False statement in connection with an election.\nNon Cognizable \npunishable with fine.",
        "Section in IPC":"S.171 G"
    },

    {
        "Section in BNS":"Sec.176",
        "Description": "Illegal payments in connection with an election. \nNon Cognizable \npunishable with fine of ten thousand rupees. \nNote: Fine increased",
        "Section in IPC":"S.171H"
    },

    {
        "Section in BNS":"Sec.177",
        "Description": "Failure to keep election accounts. \nNon Cognizable \npunishable with fine of five thousand rupees. \nNote: Fine increased",
        "Section in IPC":"S.171 G"
    },

    {
        "Section in BNS":"Sec.178",
        "Description": "Counterfeiting coin, government stamps, currencynotes or bank-notes \nCognizable offence \npunishable with imprisonment for life, or with imprisonment of either description, which may extend to ten years and fine.",
        "Section in IPC":"S.230,\nS.232,\nS.246, \nS.249, \nS.255, \nS.489 A"
    },

    {
        "Section in BNS":"Sec.179",
        "Description": "Using as genuine, forged or counterfeit coin, Government stamp, currency-notes or banknotes. \nCognizable offence \npunishable with imprisonment for life, imprisonment which may extend to ten years and fine.",
        "Section in IPC":"S.230,\nS.232,S.246,\nS.249,\nS.255,\nS.489 A"
    },

    {
        "Section in BNS":"Sec.180",
        "Description": "Possession of forged or counterfeit coin, Government stamp, currency-notes or bank-notes. \nCognizable offence \npunishable with imprisonment which may extend to seven years, or with fine, or with both.",
        "Section in IPC":"S.242,\nS.252,\nS.253,\nS.259,\nS.489C"
    },

    {
        "Section in BNS":"Sec.181",
        "Description": "Making or possessing instruments or materials for forging or counterfeiting coin, Government stamp, currency notes or bank-notes.\nCognizable offence \npunishable with imprisonment for life, imprisonment which may extend to ten years and with fine.",
        "Section in IPC":"S.233,\nS.235,\nS.256,\nS.257,\nS.489D"
    },

    {
        "Section in BNS":"Sec.182",
        "Description": "Making or using documents resembling currency-notes or bank-notes\nNon Cognizable\n(1) punishable with fine of 300 rupees.\n(2) punishable with fine of 600 rupees. \nNote: Fine increased",
        "Section in IPC":"S.489 E"
    },

    {
        "Section in BNS":"Sec.183",
        "Description": "Effacing writing from substance bearing Government stamp, or removing from document a stamp used for it, with intent to cause loss to Government \nCognizable offence \npunishable with imprisonment which may extend to three years,or with fine, or with both.",
        "Section in IPC":"S.261"
    },

    {
        "Section in BNS":"Sec.184",
        "Description": "Using Government stamp known to have been before used \nCognizable offence \npunishable with imprisonment which may extend to two years, or with fine, or with both.",
        "Section in IPC":"S.262"
    },

    {
        "Section in BNS":"Sec.185",
        "Description": "Erasure of mark denoting that stamp has been used \nCognizable offence \npunishable with imprisonment which may extend to three years,or with fine, or with both.",
        "Section in IPC":"S.263"
    },

    {
        "Section in BNS":"Sec.186",
        "Description": "Prohibition of fictitious stamps \nCognizable offence \npunishable with fine of two hundred rupees.\nSuch stamp die plate etc may be seized and if seized be forfeited.",
        "Section in IPC":"S.263 A"
    },

    {
        "Section in BNS":"Sec.187",
        "Description": "Person employed in mint causing coin to be of different weight or composition from that fixed by law \nCognizable offence \npunishable with imprisonment for seven years and fine.",
        "Section in IPC":"S.244"
    },

    {
        "Section in BNS":"Sec.188",
        "Description": "Unlawfully taking coining instrument from mint \nCognizable offence \npunishable with imprisonment for seven years and fine.",
        "Section in IPC":"S.245"
    },

    {
        "Section in BNS":"Sec.189",
        "Description": "Unlawful assembly \nCognizable offence \n(2) Punishable with imprisonment for six months, or with fine or with both. \n(3) If joining or continuing in an Unlawful assembly. Punishable with imprisonment which may extend to two years, or with fine or with both. \n(4) If joining an Unlawful assembly with deadly weapons. Cognizable punishable with imprisonment for two years, with fine or with both. \n(5) If knowingly joining or continuing, when commanded to disperse. Imprisonment for 6 months, with fine or with both. \n(6) When hiring, engaging etc to take part. Punishable with the same for as far a member of such assembly, and for any offence committed by any member ofsuch assembly.\n(7) Harboring. punishable with imprisonment for six months, with fine or with both. \n(8) Being hired to take part. punishable with imprisonment for six months, with fine or with both. \n(9) To go armed. with imprisonment for two years, with fine or with both",
        "Section in IPC":"S.245"
    },

    {
        "Section in BNS":"Sec.190",
        "Description": "Every member of unlawful assembly guilty of offence committed in prosecution of common object. \nAccording as offence is cognizable or non-cognizable",
        "Section in IPC":"S.149"
    },

    {
        "Section in BNS":"Sec.191",
        "Description": "Rioting \nCognizable offence \n(2) punishable with imprisonment for two years, or with fine, or with both. \n(3) If armed with deadly weapon, punishable with imprisonment for five years, with fine or with both. \nNote: Punishment increased",
        "Section in IPC":"S.146-148"
    },

    {
        "Section in BNS":"Sec.192",
        "Description": "Wantonly giving provocation with intent to cause riot if rioting be committed, if not committed \nCognizable offence \npunishable with imprisonment for one years, if not committed then imprisonment for six months, or fine, or both.",
        "Section in IPC":"S.153"
    },

    {
        "Section in BNS":"Sec.193",
        "Description": "Liability of owner, occupier, etc of land on which an unlawful assembly or riot takes place \nNon Cognizable \n(1) If information is not given punishable with fine one thousand rupees. \n(2) If for some person benefit, punishablewith fine. \n(3) If for agent of owner or occupier benefit, punishable with fine.",
        "Section in IPC":"S.154 \nS.156"
    },

    {
        "Section in BNS":"Sec.194",
        "Description": "Affray \nCognizable offence \npunishable with imprisonment for one month, or fine of one thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.153"
    },

    {
        "Section in BNS":"Sec.194",
        "Description": "Affray \nCognizable offence \npunishable with imprisonment for one month, or fine of one thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.159 \nS.160"
    },

    {
        "Section in BNS":"Sec.195",
        "Description": "Assaulting or obstructing public servant when suppressing riot etc.\n(1) Cognizable, punishable with imprisonment for three years, or fine not less than twenty-five thousand, or both. \nNote: Fine increased \n(2) Non-Cognizable, Whoever threatens to assault or attempts to obstruct any public servant or threatens or attempts to use criminal force to any public servant in the discharge of his duty as such public servant is endeavoring to disperse an unlawful assembly, or to suppress a riot or affray, shall be punished with imprisonment of either description for a term which may extend to one years, or with fine, or with both",
        "Section in IPC":"S.152 \nNew Provision"
    },    

    {
        "Section in BNS":"Sec.196",
        "Description": "Promoting enmity between different groups on ground of religion, race, place of birth, residence, language etc. and doing acts prejudicial to maintenance of harmony \n(1) Cognizable punishable with imprisonment for three years or fine, or both \n(2) If promoting enemity between classes, place of worship, religious assembly or ceremonies etc. Cognizable, punishable with imprisonment for five years and fine.",
        "Section in IPC":"S.153 A"
    },  

    {
        "Section in BNS":"Sec.197",
        "Description": "Imputations, assertions prejudicial to national integration \nIn Section 197(1)(d) of BNS, the act of making or publishing false or misleading information which has tendency to jeopardize the sovereignty, unity and integrity or security of India has been made an offence \nCognizable offence \n(1) punishable with imprisonment for three years, or fine, or both \n(2) If committed in place of worship etc. punishable with imprisonment for five years and fine.",
        "Section in IPC":"S.153B \nNew Provision"
    },  

    {
        "Section in BNS":"Sec.198",
        "Description": "Public servant disobeying law, with intent to cause injury to any person \nNon Cognizable \npunishable with simple imprisonment for one year, or fine, or both",
        "Section in IPC":"S.166"
    },  

    {
        "Section in BNS":"Sec.200",
        "Description": "Punishment for non-treatment of victim. \nNon Cognizable \npunishable with imprisonment for oneyear, or fine, or both",
        "Section in IPC":"S.166 B"
    },  

    {
        "Section in BNS":"Sec.201",
        "Description": "Public servant framing incorrect document with intent to cause injury. \nCognizable offence \npunishable with imprisonment for three years, or fine, or both",
        "Section in IPC":"S.167"
    }, 

    {
        "Section in BNS":"Sec.202",
        "Description": "Public servant unlawfully engaging in trade. \nNon Cognizable \npunishable with simple imprisonment for one year, or fine, or both or community service.",
        "Section in IPC":"S.168"
    }, 

    {
        "Section in BNS":"Sec.203",
        "Description": "Public servant unlawfully buying or bidding for property.\nNon Cognizable \npunishable with simple imprisonment for two years, or fine, or both and confiscation of property, if purchased.",
        "Section in IPC":"S.169"
    }, 

    {
        "Section in BNS":"Sec.204",
        "Description": "Personating public servant. \nCognizable offence \npunishable with imprisonment for not less than six months but which may extend to three years and fine.",
        "Section in IPC":"S.170"
    }, 

    {
        "Section in BNS":"Sec.205",
        "Description": "Wearing garb or carrying token used by public servant with fraudulent intent. \nCognizable offence \npunishable with imprisonment for three months or fine of five thousand rupees or both. \nNote: Fine increased",
        "Section in IPC":"S.171"
    }, 

    {
        "Section in BNS":"Sec.206",
        "Description": "Absconding to avoid service of summons or other proceeding. \nNon Cognizable \n(a) punishable with simple imprisonment for one month, or fine of five thousand rupees, or both. \n(b) punishable with simple imprisonment for six months, or fine of ten thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.172"
    }, 

    {
        "Section in BNS":"Sec.207",
        "Description": "Preventing service of summons or other proceeding, or preventing publication thereof. \nNon Cognizable \n(a) punishable with simple imprisonment for one month, or fine of five thousand rupees, or both. \n(b) punishable with simple imprisonment for six months, or fine of ten thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.173"
    }, 

    {
        "Section in BNS":"Sec.208",
        "Description": "Non-attendance in obedience to an order from public servant. \nNon Cognizable \n(a) punishable with simple imprisonment for one month, or fine of five thousand rupees, or both. \n(b) punishable with simple imprisonment for six months, or fine of ten thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.174"
    }, 

    {
        "Section in BNS":"Sec.209",
        "Description": "Non-appearance in response to a proclamation under section 84 of Bharatiya Nagarik Suraksha Sanhita, 2023. \nCognizable offence \npunishable with imprisonment for three years, or fine, or both or community service. If declaration, has been made under sub section (IV) of Section 84 BNS punishable with imprisonment for seven years and fine.",
        "Section in IPC":"S.174A"
    }, 
    
    {
        "Section in BNS":"Sec.210",
        "Description": "Omission to produce document or electronic record to public servant by person legally bound to produce it. \nNon Cognizable \n(a) punishable with simple imprisonment for one month, or fine of five thousand rupees, or both. \n(b) punishable with simple imprisonment for six months, or fine of ten thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.175"
    }, 

    {
        "Section in BNS":"Sec.211",
        "Description": "Omission to give notice or information to public servant by person legally bound to give it. Non Cognizable \n(a) punishable with simple imprisonment for one month, or fine of five thousand rupees, or both. \n(b) punishable with simple imprisonment for six months, or fine of ten thousand rupees, or both. \n(c) punishable with simple imprisonment for six months, or fine of one thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.176"
    }, 

    {
        "Section in BNS":"Sec.212",
        "Description": "Furnishing false information. \nNon Cognizable \n(a) punishable with simple imprisonment for six month, or fine of five thousand rupees, or both. \n(b) punishable with imprisonment for two years, or fine, or both. \nNote: Fine increased",
        "Section in IPC":"S.177"
    }, 

    {
        "Section in BNS":"Sec.213",
        "Description": "Refusing oath or affirmation when duly required by public servant to make it. \nNon Cognizable \npunishable with simple imprisonment for six months, or fine of five thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.178"
    }, 

    {
        "Section in BNS":"Sec.214",
        "Description": "Refusing to answer public servant authorised to question. \nNon Cognizable \npunishable with simple imprisonment for six months, or fine of five thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.179"
    }, 

    {
        "Section in BNS":"Sec.215",
        "Description": "Refusing to sign statement. \nNon Cognizable \npunishable with simple imprisonment for three months, or fine of three thousand rupees, or both. \nNote: Fine increased",
        "Section in IPC":"S.180"
    }, 

    {
        "Section in BNS":"Sec.216",
        "Description": "False statement on oath or affirmation to public servant or person authorized to administer an oath or affirmation. \nNon Cognizable \npunishable with imprisonment for three years and fine.",
        "Section in IPC":"S.181"
    },

    
    {
        "Section in BNS":"Sec. 217",
        "Description": "False information, with intent to cause public servant to use his lawful power to injury of another person.\nNon Cognizable\npunishable with imprisonment for one year or fine of ten thousand rupees or both.\nNote: Punishment & Fine increased",
        "Section in IPC":"S. 182"
    },

    {
        "Section in BNS":"Sec. 218",
        "Description": "Resistance to taking of property by lawful authority of a public servant.\nNon Cognizable\n punishable with imprisonment for six months or fine of ten thousand rupees or both.\nNote: Fine increased",
        "Section in IPC":"S. 183"
    },

    {
        "Section in BNS":"Sec. 219",
        "Description": "Obstructing sale of property offered for sale by authority of public servant.\nNon Cognizable\npunishable with imprisonment for one month or fine of five thousand rupees or both.\n Note: Fine increased",
        "Section in IPC":"S. 184"
    },

    {
        "Section in BNS":"Sec. 220",
        "Description": "Illegal purchase or bid for property offered for sale by authority of public servant.\nNon Cognizable\npunishable with imprisonment for one month, or fine of two hundred rupees or both.",
        "Section in IPC":"S. 185"
    },

    {
        "Section in BNS":"Sec. 221",
        "Description": "Obstructing public servant in discharge of public functions.\nNon Cognizable\npunishable with imprisonment for three months or fine of two thousand five hundred rupees or both.\nNote: Fine increased",
        "Section in IPC":"S. 186"
    },

    {
        "Section in BNS":"Sec. 222",
        "Description": "Omission to assist public servant when bound by law to give assistance.\nNon Cognizable\n(a)  punishable with simple imprisonment for one month or fine of two thousand five hundred rupees or both.(b)  punishable with imprisonment for six months or fine of five thousand rupees or both.\nNote: Fine increased",
        "Section in IPC":"S. 187"
    },

    {
        "Section in BNS":"Sec. 223",
        "Description": "Disobedience to order duly promulgated by public servant.\nCognizable offence\n(a)  punishable with simple imprisonment for six months or fine of two thousand five hundred rupees or both.\n(b)  Cognizable punishable with imprisonment for one year or fine of five thousand rupees or both.\nNote: Punishment & Fine increased",
        "Section in IPC":"S. 188"
    },

    {
        "Section in BNS":"Sec. 224",
        "Description": "Threat of injury to public servant.\nNon Cognizable\npunishable with imprisonment for two years, or fine or both.",
        "Section in IPC":"S. 189"
    },

    {
        "Section in BNS":"Sec. 225",
        "Description": "Threat of injury to induce person to refrain from applying for protection to public servant.\nNon Cognizable\npunishable with imprisonment for one year, or fine or both.",
        "Section in IPC":"S. 190"
    },

    {
        "Section in BNS":"Sec. 226",
        "Description": "Attempt to commit suicide to compel or restraint exercise of lawful power\nA new Section 226 has been added in the BNS, 2023 to punish those who attempt to commit suicide with the intent to compel or restrain the exercise of any lawful power by a public servant.\nNon Cognizable\npunishable with imprisonment for one year, or fine or both, or community service.",
        "Section in IPC":"S. New Section"
    },

    {
        "Section in BNS":"Sec. 227",
        "Description": "Giving false evidence (Definition)",
        "Section in IPC":"S. 191"
    },

    {
        "Section in BNS":"Sec. 228",
        "Description": "Fabricating false evidence (Definition)",
        "Section in IPC":"S. 192"
    },

    {
        "Section in BNS":"Sec. 229\n(1)&\n(2)",
        "Description": "Punishment for false evidence\nNon Cognizable\n(1) punishable with imprisonment for seven years and ten thousand rupees.\n(2)  punishable with imprisonment for three years and five thousand rupees.\nNote: Fine increased",
        "Section in IPC":"S. 193"
    },

    {
        "Section in BNS":"Sec. 230\n(1)&\n(2)",
        "Description": "Giving or fabricating false evidence with intent to procure conviction of capital offence.\nNon Cognizable\n(1)  punishable with imprisonment for life, or rigorous imprisonment for ten years and fifty thousand rupees.\n(2)  If innocent is convicted and executed. punishable with death, or as above.\nNote: Fine increased",
        "Section in IPC":"S. 194"
    },

    {
        "Section in BNS":"Sec. 231",
        "Description": "Giving or fabricating false evidence with intent to procure conviction of offence punishable with imprisonment of life or imprisonment.\nNon Cognizable\npunishable with the same as for the offence.",
        "Section in IPC":"S. 195"
    },

    {
        "Section in BNS":"Sec. 232\n(1)&\n(2)",
        "Description": "Threatening any person to give false evidence.\nCognizable offence\n(1)  punishable with imprisonment for seven years, or fine or both.\n(2)  punishable with the same as for the offence",
        "Section in IPC":"S. 195 A"
    },

    {
        "Section in BNS":"Sec. 233",
        "Description": "Using evidence known to be false.\nNon Cognizable\n punishable with the same as for giving or fabricating false evidence.",
        "Section in IPC":"S. 196"
    },

    {
        "Section in BNS":"Sec. 234",
        "Description": "Issuing or signing false certificate.\nNon Cognizable\n punishable with the same as for giving or fabricating false evidence.",
        "Section in IPC":"S. 197"
    },

    {
        "Section in BNS":"Sec. 235",
        "Description": "Using as true a certificate known to be false.\nNon Cognizable\npunishable with the same as for giving or fabricating false evidence.",
        "Section in IPC":"S. 198"
    },

    {
        "Section in BNS":"Sec. 226",
        "Description": "False statement made in declaration which is by law receivable as evidence.\nNon Cognizable\npunishable with the same as for giving or fabricating false evidence.",
        "Section in IPC":"S. 199"
    },

    {
        "Section in BNS":"Sec. 237",
        "Description": "Using as true such declaration knowing it to be false.\nNon Cognizable\npunishable with the same as for giving or fabricating false evidence.",
        "Section in IPC":"S. 200"
    },

    {
        "Section in BNS":"Sec. 238",
        "Description": "Causing disappearance of evidence of offence, or giving false information to screen offender.\n(a)  If the offence punishable with death, shall be punished with imprisonment for seven years and fine. According to the offence Cognizable/Non cognizable\n(b)  If the offence is punishable with imprisonment of life or imprisonment, which may extend to ten years shall be punished with imprisonment which may extend to three years and fine. Non cognizable.\n(c)  If the offence is punishable with imprisonment of any term not exceeding ten years, shall be punished with imprisonment for 1/4th of the longest term provided for the offence, or fine, or both. Non cognizable.",
        "Section in IPC":"S. 201"
    },

    {
        "Section in BNS":"Sec. 239",
        "Description": "Intentional omission to give information of offence by person bound to inform.\nNon Cognizable\nPunishable with imprisonment for six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S. 202"
    },

    {
        "Section in BNS":"Sec. 240",
        "Description": "Giving false information respecting an offence committed.\nNon Cognizable\nPunishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":"S. 203"
    },

    {
        "Section in BNS":"Sec. 241",
        "Description": "Destruction of document or electronic record to preventits production as evidence.\nNon Cognizable\nPunishable with imprisonment for three years, or fine of five thousand rupees, or both.\nNote: Punishment & Fine increased",
        "Section in IPC":"S. 204"
    },

    {
        "Section in BNS":"Sec. 242",
        "Description": "False personation for purpose of act or proceeding in suit or prosecution.\nNon Cognizable\nPunishable with imprisonment for three years, or fine, or both.",
        "Section in IPC":"S. 205"
    },

    {
        "Section in BNS":"Sec. 243",
        "Description": "Fraudulent removal or concealment of property to prevent its seizure as forfeited or in execution.\nNon Cognizable\nPunishable with imprisonment for three years, or fine of five thousand rupees, or both.\nNote: Punishment & Fine increased",
        "Section in IPC":"S. 206"
    },

    {
        "Section in BNS":"Sec. 244",
        "Description": "Fraudulent claim to property to prevent its seizure as forfeited or in execution.\nNon Cognizable\nPunishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":"S. 207"
    },

    {
        "Section in BNS":"Sec. 245",
        "Description": "Fraudulently suffering decree for sum not due.\nNon Cognizable\nPunishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":"S. 208"
    },

    {
        "Section in BNS":"Sec. 246",
        "Description": "Dishonestly making false claim in Court.\nNon Cognizable\nPunishable with imprisonment for two years and fine.",
        "Section in IPC":"S. 209"
    },

    {
        "Section in BNS":"Sec. 247",
        "Description": "Fraudulently obtaining decree for sum not due.\nNon Cognizable\nPunishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":"S. 210"
    },

    {
        "Section in BNS":"Sec. 248",
        "Description": "False charge of offence made with intent to injure.\nNon Cognizable\n(a)  Punishable with imprisonment for five years, or fine of two lakh rupees, or both.\n(b)  Punishable with imprisonment for ten years and fine.\nNote: Punishment & Fine increased",
        "Section in IPC":"S. 211"
    },

    {
        "Section in BNS":"Sec. 249",
        "Description": "Harboring offender\nCognizable offence\n(a)  Punishable with imprisonment for five years and fine.\n(b)  If punishable imprisonment with life or imprisonment for ten years. Punishable with imprisonment for three years and fine.\n(c)  Punishable with imprisonment for one year and not for ten years. Punishable with imprisonment for 1/4th of the longest term, and of the description, provided for the offence, or fine or both.",
        "Section in IPC":"S. 212"
    },

    {
        "Section in BNS":"Sec. 250",
        "Description": "Taking gift, etc. to screen an offender from punishment.\nCognizable offence\n(a)  if the offence is punishable with death, shall be punished with imprisonment of either description for a term which may extend to seven years and shall also be liable to fine.\n(b)  If punishable imprisonment with life or imprisonment for ten years shall be punished with imprisonment for three years and fine.\n(c)  Punishable with imprisonment for less than ten years shall be punished with imprisonment for 1/4th of the longest term provided for the offence, or fine or both.",
        "Section in IPC":"S. 213"
    },

    {
        "Section in BNS":"Sec. 251",
        "Description": "Offering gift or restoration of property in consideration of screening offender.\nNon Cognizable\n(a)   Punishable with imprisonment for seven years and fine.\n(b)  Punishable with imprisonment for three years and fine.\n(c)  Punishable with imprisonment for 1/4th of the longest term, provided for the offence, or fine or both.",
        "Section in IPC":"S. 214"
    },

    {
        "Section in BNS":"Sec. 252",
        "Description": "Taking gift to help to recover stolen property, etc.\nCognizable offence\nPunishable with imprisonment for two years, or fine or with fine",
        "Section in IPC":"S. 215"
    },

    {
        "Section in BNS":"Sec. 253",
        "Description": "Harboring offender who has escaped from custody or whose apprehension has been ordered.\nCognizable offence\n(a)  Imprisonment for seven years and fine, if the offender of offence punishable with death has escaped\n(b)  Imprisonment for three years with or without fine. If the offender of offence punishable imprisonment with life or imprisonment for ten years has escaped.\n(c)   Imprisonment for 1/4th of the longest term provided for the offence, or fine, or both if the offender of offence punishable with imprisonment for one year and not to ten years has escaped.",
        "Section in IPC":"S. 216"
    },

    {
        "Section in BNS":"Sec. 254",
        "Description": "Penalty for harboring robbers or dacoits.\nCognizable offence\nPunishable with rigorous imprisonment for seven years and fine.",
        "Section in IPC":"S. 216A"
    },

    {
        "Section in BNS":"Sec. 255",
        "Description": "Public servant disobeying direction of law with intentto save person from punishment or property from forfeiture. \nNon Cognizable\nPunishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":"S. 217"
    },

    {
        "Section in BNS":"Sec. 256",
        "Description": "Public servant framing incorrect record or writing with intent to save person from punishment or property from forfeiture.\nCognizable offence\n Punishable with imprisonment for three years, or fine, or both",
        "Section in IPC":"S. 218"
    },

    {
        "Section in BNS":"Sec. 257",
        "Description": "Public servant in judicial proceeding corruptly making report, etc., contrary to law.\nNon Cognizable\nPunishable with imprisonment for seven years, or fine, or both.",
        "Section in IPC":"S. 219"
    },

    {
        "Section in BNS":"Sec. 258",
        "Description": "Commitment for trial or confinement by person having authority who knows that he is acting contrary to law.\nNon Cognizable\nPunishable with imprisonment for seven years, or fine, or both.",
        "Section in IPC":"S. 220"
    },

    {
        "Section in BNS":"Sec. 259",
        "Description": "Intentional omission to apprehend on part of public servant bound to apprehend.\n(a)   Cognizable or Non cognizable as per offence. Punishable with imprisonment for seven years, with or without fine, If the subject was charged for the offence punishable with death\n(b )  Cognizable. Punishable with imprisonment for three years with or without fine. If the subject was charged for the offence punishable with imprisonment with life or imprisonment for ten years.\n(c)   Cognizable. Punishable with imprisonment for two years with or without fine, if the subject was charged for the offence punishable with imprisonment for less than ten Years.",
        "Section in IPC":"S. 221"
    },

    {
        "Section in BNS":"Sec. 260",
        "Description": " Intentional omission to apprehend on part of public servant bound to apprehend person under sentence or lawfully committed.\nCognizable offence\n(a)  If offence is under sentence of death. Punishable with imprisonment for life, imprisonment for fourteen years, with or without fine.\n(b)  If offence is under sentence of imprisonment for life or imprisonment for ten years, or upwards. Punishable with imprisonment for seven years with or without fine.\n(c)  If under sentence of imprisonment for less than ten years. Punishable with imprisonment for three years, or fine, or both.",
        "Section in IPC":"S. 218"
    },

    
    {
        "Section in BNS":"Sec.260",
        "Description": " (b)  If offence is under sentence of imprisonment for life or imprisonment for ten years, or upwards. Punishable with imprisonment for seven years with or without fine.\n (c)  If under sentence of imprisonment for less than ten years.Punshabe with imprisonment for three years, or fine, or both.",
        "Section in IPC":"S.222"

    },

    {
        "Section in BNS":"Sec.261",
        "Description": "Escape from confinement or custody negligently suffered by public servant.\nNon Cognizable\n Punishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":" S.223"
    },

    {
        "Section in BNS":"Sec.262",
        "Description":"Resistance or obstruction by a person to his lawful apprehension.\nCognizable offence\nPunishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":" S.224"
    },
    
    {
        "Section in BNS":"Sec.263",
        "Description":" Resistance or obstruction to lawful apprehension of another person.\nCognizable offence.\nPunishable with different type of punishments for clauses ‘a to e’ ranging from imprisonment for two years, imprisonment for life, imprisonment for ten years and fine etc.",
        "Section in IPC":" S.225"
    },

    {
        "Section in BNS":"Sec.264",
        "Description":"Omission to apprehend or sufferance of escape, on partof public servant, in cases not otherwise provided for.\nNon Cognizable\n Punishable with imprisonment for three years/two years or fine, or both (clause a & b)",
        "Section in IPC":"S.225 A"
    },

    {
        "Section in BNS":"Sec. 265",
        "Description":" Resistance or obstruction to lawful apprehension or escape or rescue in cases not otherwise provided for.\nCognizable offence\nPunishable with imprisonment for six months, or fine or both.",
        "Section in IPC":"S.225 B"
    },

    {
        "Section in BNS":"Sec. 266",
        "Description":"Violation of condition of remission of punishment.\nCognizable offence\n Punishable with punishment of original sentence, or if part of this punishment undergone, the residue.",
        "Section in IPC":" S.227"
    },

    {
        "Section in BNS":"Sec.267",
        "Description":" Intentional insult or interruption to public servant sitting in judicial proceeding.\nNon Cognizable\n Punishable with simple imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.228"
    },

    {
        "Section in BNS":"Sec.268",
        "Description":"Personation of assessor.\nNon Cognizable\nPunishable with imprisonment of two years, or fine, or both.",
        "Section in IPC":"S.229"
    },

    {
        "Section in BNS":"Sec.269",
        "Description":"Failure by person released on bail or bond to appear in court.\nCognizable offence\nPunishable with imprisonment of one year, or fine, or both.",
        "Section in IPC":"S.229 A"
    },

    {
        "Section in BNS":"Sec.270",
        "Description":"Public nuisance",
        "Section in IPC":"S.268"
    },

    {
        "Section in BNS":"Sec.271",
        "Description":" Negligent act likely to spread infection of disease dangerous to life.\nCognizable offence\n Punishable with imprisonment of six months, or fine, or both.",
        "Section in IPC":"S.269"
    },

    {
        "Section in BNS":"Sec.272",
        "Description":"Malignant act likely to spread infection of disease dangerous to life,\n Cognizable offence\nPunishable with imprisonment of two years, or fine, or both.",
        "Section in IPC":"S.270"
    },

    {
        "Section in BNS":"Sec.273",
        "Description":" Disobedience to quarantine rule.\nNon Cognizable\nPunishable with imprisonment of six months, or fine, or both.",
        "Section in IPC":"S.271"
    },

    {
        "Section in BNS":"Sec.274",
        "Description":"Adulteration of food or drink intended for sale.\nNon Cognizable\nPunishable with imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.272"
    },

    {
        "Section in BNS":"Sec.275",
        "Description":"Sale of noxious food or drink.\nNon Cognizable\n Punishable with imprisonment of six months, or fine of five thousand rupees, or both\nNote: Fine increased",
        "Section in IPC":"S.273"
    },

    {
        "Section in BNS":"Sec.276",
        "Description":"Adulteration of drugs\nNon Cognizable\nPunishable with imprisonment of one year, or fine of five thousand rupees, or both.\nNote: Punishment & Fine increased",
        "Section in IPC":"S.274"
    },

    {
        "Section in BNS":"Sec.277",
        "Description":"Sale of adulterated drugs\nNon Cognizable\n Punishable with imprisonment of six months, or fine of five thousand rupees, or both.\n Note: Fine increased",
        "Section in IPC":"S.275"
    },

    {
        "Section in BNS":"Sec.278",
        "Description":"Sale of drug as a different drug or preparation\nNon Cognizable\n Punishable with imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.276"
    },

    {
        "Section in BNS":"Sec.279",
        "Description":"Fouling water of public spring or reservoir\nCognizable offence\nPunishable with imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Punishment & Fine increased",
        "Section in IPC":"S.277"
    },

    {
        "Section in BNS":"Sec.280",
        "Description":"Making atmosphere noxious to health\nNon Cognizable\n Punishable with imprisonment or fine of one thousand rupees.\nNote: Fine increased",
        "Section in IPC":"S.278"
    },

    {
        "Section in BNS":"Sec.281",
        "Description":"Rash driving or riding on a public way\nCognizable offence\nPunishable with imprisonment of six months, or fine of one thousand rupees, or both.",
        "Section in IPC":"S.279"
    },

    {
        "Section in BNS":"Sec.282",
        "Description":"Rash navigation of vessel\nCognizable offence\nPunishable with imprisonment of six months, or fine of ten thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.280"
    },

    {
        "Section in BNS":"Sec.283",
        "Description":"Exhibition of false light, mark or buoy\nCognizable offence\nPunishable with imprisonment of seven years and fine which shall not be less than ten thousand rupees.\nNote: Fine increased",
        "Section in IPC":"S.281"
    },

    {
        "Section in BNS":"Sec.284",
        "Description":" Conveying person by water for hire in unsafe or over loaded vessel\nCognizable offence\nPunishable with imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.282"
    },

    {
        "Section in BNS":"Sec.285",
        "Description":"Danger or obstruction in public way or line of navigation\nCognizable offence\nPunishable with fine of five thousand rupees.\nNote: Fine increased",
        "Section in IPC":"S.283"
    },

    {
        "Section in BNS":"Sec.286",
        "Description":"Negligent conduct with respect to poisonous substance\nCognizable offence\nPunishable with imprisonment of six months,or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.284"
    },

    {
        "Section in BNS":"Sec.287",
        "Description":"Negligent conduct with respect to fire or combustible matter.\nCognizable offence\nPunishable with imprisonment of 6 months, or fine of two thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.285"
    },

    {
        "Section in BNS":"Sec.288",
        "Description":"Negligent conduct with respect to explosive substance\nCognizable offence\nPunishable with imprisonment of six months,or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.286"
    },

    {
        "Section in BNS":"Sec.289",
        "Description":"Negligent conduct with respect to machinery\nNon Cognizable\nPunishable with imprisonment of six months, or fine of five thousand rupees, or both.\n Note: Fine increased",
        "Section in IPC":"S.287"
    },

    {
        "Section in BNS":"Sec.290",
        "Description":" Negligent conduct with respect to pulling down, repairing or constructing buildings, etc.\nNon Cognizable\nPunishable with imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.288"
    },

    {
        "Section in BNS":"Sec.291",
        "Description":" Negligent conduct with respect to animal\nCognizable offence\nPunishable with imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.289"
    },

    {
        "Section in BNS":"Sec.292",
        "Description":"Punishment for public nuisance in cases not otherwise provided for.\nNon Cognizable\nPunishable with fine of one thousand rupees.\nNote: Fine increased",
        "Section in IPC":"S.290"
    },

    {
        "Section in BNS":"Sec.293",
        "Description":"Continuance of nuisance after injunction to discontinue\nCognizable offence\nPunishable with imprisonment of six months, or fine of five thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.291"
    },

    {
        "Section in BNS":"Sec.294 (1)& (2)",
        "Description":"Sale, etc., of obscene books, etc.\nCognizable offence\nPunishable with imprisonment of two years and fine of five thousand rupees and second or subsequent conviction imprisonment of five years and fine of ten thousand rupees.\nNote: Fine increased",
        "Section in IPC":"S.292"
    },

    {
        "Section in BNS":"Sec.295",
        "Description":"Sale, etc., of obscene objects to child\nCognizable offence\nPunishable with imprisonment of three years and fine of two thousand rupees and second or subsequent conviction imprisonment of seven years and fine of five thousand rupees.",
        "Section in IPC":"S.293"
    },

    {
        "Section in BNS":"Sec.296",
        "Description":" Obscene acts and songs\nCognizable offence\nPunishable with imprisonment of three months, or fine of one thousand rupees, or both.\nNote: Fine increased",
        "Section in IPC":"S.294"
    },

    {
        "Section in BNS":"Sec.297 (1)&(2)",
        "Description":"Keeping lottery office\nNon Cognizable\nPunishable with imprisonment of six months, or fine, or both and if publishing proposal then fine of five thousand rupees.\nNote: Fine increased",
        "Section in IPC":"S.294 A"
    },

    {
        "Section in BNS":"Sec.298",
        "Description":"Injuring or defiling place of worship with intent to insult religion of any class\nCognizable offence\nPunishable with imprisonment of two years, or fine, or both.",
        "Section in IPC":"S.295"
    },

    {
        "Section in BNS":"Sec.299",
        "Description":"Deliberate and malicious acts, intended to outrage religious feelings of any class by insulting its religion or religious beliefs\nCognizable offence\nPunishable with imprisonment of three years, or fine, or both.",
        "Section in IPC":"S.295A"
    },

    {
        "Section in BNS":"Sec.300",
        "Description":"Disturbing religious assembly\nCognizable offence\nPunishable with imprisonment of one year, or fine, or both.",
        "Section in IPC":"S.296"
    },

    {
        "Section in BNS":"Sec.301",
        "Description":"Trespassing on burial places, etc.\n Cognizable offence\nPunishable with imprisonment of one year, or fine, or both.",
        "Section in IPC":"S.297"
    },

    {
        "Section in BNS":"Sec.302",
        "Description":"Uttering words etc., with deliberate intent to wound religious feelings of any person\nNon Cognizable\nPunishable with  imprisonment of one year, or fine, or both.",
        "Section in IPC":"S.298"
    },

    {
        "Section in BNS":"Sec.303 (1)&(2)",
        "Description":"Theft\n(1)  Whoever, intending to take dishonestly any movable property out of the possession of any person without that person’s consent in order to such taking, is said to commit theft\n(2)  Cognizable and punishable with imprisonment, which may extend to 3 years or with fine or with both. of one year, or fine, or both and in case of second or subsequent conviction of any person under this section, he shall be punished with rigorous imprisonment for not less than one year but which may extend to five years and with fine\nNon Cognizable\nif value of property is less than five thousand\nand a person is convicted for the first time, shall upon return of the value of the property or restoration of the stolen property shall be punished with community service.",
        "Section in IPC":"S.378- S.379"
    },

    {
        "Section in BNS":"Sec.304 (1)&(2)",
        "Description":" Snatching\nTheft is snatching, if in order to commit theft, the offender suddenly or quickly or forcibly seizes or secures or grabs or takes away from any person or from his possession any movable property.\nCognizable offence\nPunishable with imprisonment of  three years and shall also be liable to fine.",
        "Section in IPC":" New Provision"
    },
    
    {
        "Section in BNS":"Sec.305",
        "Description":"Theft in a dwelling house, or means of transportation or place of worship etc.\n(a)  in any building, tent or vessel used as a human welling or used for the custody of property; or\n(b)  of any means of transport used for the transport of goods or passengers; or\n(c)  of any article or goods from any means of transport used for the transport of goods or passengers; or\n(d)  of idol or icon in any place of worship; or\n(e)  of any property of the Government or of a local authority,\nCognizable offence\nPunishable with imprisonment of seven years and fine.",
        "Section in IPC":"S.380\nNew Additions"
    },

    {
        "Section in BNS":"Sec.306",
        "Description":"Theft by clerk  or servant of property in possession of master\nCognizable offence\nPunishable with imprisonment , which may extend to seven years and with fine.\n",
        "Section in IPC":"S.381"
    },

    {
        "Section in BNS":"Sec.307",
        "Description":" Theft after preparation made for causing death, hurt, or restraint in order to committing of theft\nCognizable offence\nPunishable with rigorous imprisonment of ten years and with fine.\n",
        "Section in IPC":"S.382"
    },

    
    {
        "Section in BNS":"Sec.308 (1) - (7)",
        "Description": "Extortion Illustrations (e) A threatens Z by sending a message through an electronic device that “your child is in my possession, and will be put to death unless you send me one lakh rupees”. A thus induces Z to give him money. A has committed extortion.Cognizable offence (2) punishable with imprisonment of either description which may extend to seven years, or with fine, or with both.(3) if attempted to commit extortion by putting any person in fear, of any injury, shall be punishable with imprisonment of either description which may extend to two years, or with fine, or with both.(4) if in order to the committing of extortion, put any person in fear of death or grievous hurt, shall be punishable with imprisonment of either description which may extend to seven years and fine. (5) if commits extortion by putting any person in fear of death or grievous hurt, shall be punishable with imprisonment of either description which may extend to ten years and fine. (6) if in order to the committing of extortion, put any person in fear of an acquisition of an offence punishable with death or imprisonment for life or with imprisonment which may extend to ten years than punishable with imprisonment of either description which may extend to ten years and fine. (7) if commits extortion, put any person in fear of an acquisition of an offence punishable with death or imprisonment for life or with imprisonment which may extend to ten years than punishable with imprisonment of either description which may extend to ten years and fine.",
        "Section in IPC":"S. 109"
    },

    {
        "Section in BNS":"Sec.309 (1) to (6)",
        "Description": "Robbery In all robbery there is either theft or extortion (2) … when theft is robbery (3) … when extortion is robbery Cognizable offence (4) if commits robbery, shall be punished with imprisonment of either description which may extend to ten years and fine. If robbery is committed on highway between sunset and sunrise than punishable with imprisonment of either description which may extend to fourteen years. (5) if attempt to commits robbery, than punishable with rigorous imprisonment which may extend to seven years and fine. (6) if in committing or attempting to commit robbery, voluntarily causing hurt, than punishable with imprisonment for life or with rigorous imprisonment for term which may extend to ten years and fine.",
        "Section in IPC":"S.390 S.392 S.394"
    },

    {
        "Section in BNS":"Sec.309 (1) to (6)",
        "Description": "Dacoity Cognizable offence (2) if commits dacoity, than punishable with imprisonment for life or with rigorous imprisonment which may extend to ten years and fine. (3) if while committing dacoity commits murder, than punishable with death, or imprisonment for life, or with rigorous imprisonment for term not less than ten years and fine. (4) if making preparation to commit dacoity, than punishable with rigorous imprisonment for ten years and fine. (5) if assembled for the purpose of committing dacoity,than punishable with rigorous imprisonment for term which may extend to seven years and fine. (6) if person belongs to gang of person associated for the purpose of habitually committing dacoity than punishable with imprisonment for life, or with rigorous imprisonment for term which may extend to ten years and fine.",
        "Section in IPC":"S.391 S.395 S.396 S.399 S.400 S.402"
    },

    {
        "Section in BNS":"Sec.311",
        "Description": "Robbery, or dacoity, with attempt to cause death, or grievous hurt. Cognizable offence Punishable with imprisonment of not less than seven years.",
        "Section in IPC":"S.397"
    },

    {
        "Section in BNS":"Sec.312",
        "Description": "Attempt to commit robbery or dacoity when armed with deadly weapon.Cognizable offence Punishable with imprisonment for not less than seven years",
        "Section in IPC":"S.398"
    },

    {
        "Section in BNS":"Sec.313",
        "Description": "Punishment for belonging to gang of robbers, etc. Cognizable offence Punishable with rigorous imprisonment for seven years and fine.",
        "Section in IPC":"S.401"
    },

    {
        "Section in BNS":"Sec.314",
        "Description": "Dishonest misappropriation of property. Non Cognizable Punishable with imprisonment of not less than six months but which may extend to two years and fine.",
        "Section in IPC":"S.403"
    },

    {
        "Section in BNS":"Sec.315",
        "Description": "Dishonest misappropriation of property possessed by deceased person at the time of his death. Non Cognizable Punishable with imprisonment for three years and fine. If by clerk etc than imprisonment for seven years.",
        "Section in IPC":"S.404"
    },

    {
        "Section in BNS":"Sec.316 (1) to (5)",
        "Description": "Criminal breach of trust Cognizable offence (2) if commits criminal breach of trust, Shall bepunished with imprisonment of either description which may extend to five years or with fine, or wit both.(3) if commits criminal breach of trust, of property entrusted as a carrier, war finger or warehousekeeper Shall be punished with imprisonment of either description which may extend to seven years and fine. (4) if criminal breach of trust is committed by a clerk, or servant entrusted with property etc., Shall be punished with imprisonment of either description which may extend to seven years and fine. (5) if criminal breach of trust is committed by a public servant, banker, broker etc., Shall be punished with imprisonment of either description which may extend to seven years and fine. Note: Punishment increased",
        "Section in IPC":"S.405-S.409"
    },

    {
        "Section in BNS":"Sec.317 (1) to (5)",
        "Description": "Stolen property Stolen property (2) if receives or retains stolen property, than punishable with imprisonment of either description which may extend to three years or with fine or with both.(3) if receives or retains stolen property transferred by commission of dacoity etc., than punishable with imprisonment for life or rigorous imprisonment which may extend to ten years and fine. (4) if habitually receives or deals in stolen property, than punishable with imprisonment for life or, imprisonment of either description which may extend to ten years and fine. (5) if assists in concealing of stolen property, than punishable with imprisonment of either description which may extend to three years or with fine, or with both. ",
        "Section in IPC":"S.410- S.414"
    },

    {
        "Section in BNS":"Sec.318 (1) to (4)",
        "Description": "Cheating Non Cognizable (2) if cheats, than punishable with imprisonment of either description which may extend to two years or with fine, or with both. (3) if cheats the person whose interest offender is bound to protect, than punishable with imprisonment of either description which may extend to five years or with fine, or with both. Cognizable offence(4) if cheats and dishonestly induces the person to deliver property to any person etc, to make, alter or destroy the whole or any part of valuable security etc., than punishable with imprisonment of either description which may extend to seven years and fine. Note: Punishment increased",
        "Section in IPC":"S.415 S.417 S.418 S.420"
    },

    {
        "Section in BNS":"Sec.319 (1) & (2)",
        "Description": "Cheating by personation. Cognizable offence Punishable with imprisonment for five years, or fine, or both.",
        "Section in IPC":"S.416 S.419"
    },

    {
        "Section in BNS":"Sec.320",
        "Description": "Dishonest or fraudulent removal or concealment of property to prevent distribution among creditors. Non Cognizable Punishable with imprisonment of not less than six months but which may extend to two years, or fine, or both.",
        "Section in IPC":"S.421"
    },

    {
        "Section in BNS":"Sec. 321",
        "Description": "Dishonestly or fraudulently preventing debt beingavailable for creditors. Non Cognizable Punishable with imprisonment for two years or fine, or both.",
        "Section in IPC":"S.422"
    },

    {
        "Section in BNS":"Sec.322",
        "Description": "Dishonest or fraudulent execution of deed of transfer containing false statement of consideration. Non Cognizable Punishable with imprisonment for three years or fine, or both. Note: Punishment increased",
        "Section in IPC":"S.423"
    },

    {
        "Section in BNS":"Sec.323",
        "Description": "Dishonest or fraudulent removal or concealment of property. Non Cognizable Punishable with imprisonment for three years or fine, or both. Note: Punishment increased",
        "Section in IPC":"S.424"
    },

    {
        "Section in BNS":"Sec.324 (1) to (6)",
        "Description": "Mischief The offence of mischief in Section 324 of BNS has been expanded and causing loss or damage to any property including the property of Government or Local Authority has been made punishable offence with imprisonment extendable up to one year, or with fine, or with both (as against just 6 months or with fine, or both for offence of mischief). In case of loss or damage is of more than 20,000 rupees but less than one lakh rupees the punishment is extended up to two years, or with fine, or with both. Where loss or damage is above one lakh rupees the punishment would be imprisonment extendable up to five years, or with fine, or with both. Non Cognizable (2) if commits mischief than punishable with  imprisonment of either description which may extend to six months or with fine, or with both. (3) if commits mischief and causes loss to government or local authority than punishable with imprisonment which may extend to one year or with fine, or with both. Note: Punishment increased (4) if commits mischief causing loss or damage to the amount of twenty thousand rupees and more but less than one lakh rupees than punishable with imprisonment of either description which may extend to two years or with fine, or with both. Cognizable offence (5) if commits mischief causing loss or damage of one lakh rupees or upwards than punishable with imprisonment of either description which may extend to five years or with fine, or with both. (6) if commits mischief making preparation for causing death or hurt or wrongful restraints or fear of death etc. than punishable with imprisonment of either description which may extend to five years and fine.",
        "Section in IPC":"S.425- S.427 S.440"
    },

    {
        "Section in BNS":"Sec.325",
        "Description": "Mischief by killing or maiming animal. Cognizable offence Punishable with imprisonment for five years or fine, or both. Note: Punishment increased",
        "Section in IPC":"S.428- S.429"
    },

    {
        "Section in BNS":"Sec.326",
        "Description": "Mischief by injury, inundation, fire or explosive substance, etc. Cognizable offence (a to g) except ‘e’ which is Non Cognizable (a) if commits mischief which causes diminution of water supply for agriculture purpose or for food or drink for human beings or for animal etc. than punishable with imprisonment of either description which may extend to five years or with fine, or with both. (b) if commits mischief which renders any public road, breach, navigable river etc. less safe for travelling or conveying property than punishable with imprisonment of either description which may extend to five years or with fine, or with both. (c) if commits mischief which causes inundation or an obstruction to any public drainage etc than punishable with imprisonment of either description which may extend to five years or with fine, or with both. (d) if commits mischief by destroying or moving any sign or signal used by railways, aircraft or ship etc than punishable with imprisonment of either description which may extend to seven years or with fine, or with both. (e) Non Cognizable if commits mischief by destroying or moving any landmark fixed by authority or public servant etc than punishable with imprisonment of either description which may extend to one year or with fine, or with both. (f) if commits mischief causing damage to any property including agriculture produce than punishable with imprisonment of either description which may extend to seven years and fine. (g) if commits mischief causing destruction by fire or any explosive substance in destruction of any building, place of worship or as a human dwelling etc. than punishable with imprisonment of either description which may extend to ten years and fine.",
        "Section in IPC":"S.430-S.436"
    },

    {
        "Section in BNS":"Sec.327 (1) & (2)",
        "Description": "Mischief with intent to destroy or make unsafe a rail, aircraft, decked vessel or one of twenty tons burden. Cognizable offence (1) Punishable with imprisonment for ten years and fine.(2) if attempts to commit mischief by fire or any explosive substance, shall be punished with imprisonment of life, or may extend to ten years and with fine.", 
        "Section in IPC":"S.437- S.438"
    },

    {
        "Section in BNS":"Sec.328",
        "Description": "Punishment for intentionally running vessel around or ashore with intent to commit theft, etc. Cognizable offence Punishable with imprisonment for ten years and fine.",
        "Section in IPC":"S. 439"
    },

    {
        "Section in BNS":"Sec.329 (1) to (4)",
        "Description": "Criminal trespass and house- trespass Cognizable offence (3) Criminal trespass. Punishable with imprisonment for three months, or fine of five thousand rupees, or both. (4) House trespass. Punishable with imprisonment for one year, or fine of five thousand rupees, or both. Note: Punishment increased",
        "Section in IPC":"S.441- S.442 S..447- S.448"
    },

    {
        "Section in BNS":"Sec.330 (1) & (2)",
        "Description": "House-trespass and house- breaking. (Definition clauses )",
        "Section in IPC":"S. 443, S.445"
    },

    {
        "Section in BNS":"Sec.331 (1) to (8)",
        "Description": "Punishment for house-trespass or house-breaking. Cognizable offence (1) if commits lurking house-trespass or house breaking, than punishable with imprisonment for two years and fine. (2) if commits lurking house-trespass or house breaking after sunset and before sunrise, than punishable with imprisonment for three years and fine. (3) if in order to committing lurking house-trespass or house breaking of any offence punishable with imprisonment, than punishable with imprisonment of three years and fine and if theft is committed than punishable with imprisonment which may extend to ten years.(4) if in order to committing lurking house-trespass or house breaking of any offence punishable with imprisonment after sunset and before sunrise, than punishable with imprisonment of five years and fine and if theft is committed than punishable with imprisonment which may extend to fourteen years. (5) if commits lurking house-trespass or house breaking after making preparation for causing, hurt, assault, wrongful restraint or fear of hurt or of assault or wrongful restraint than punishable with imprisonment of ten years and fine. (6) if commits lurking house-trespass or house breaking after sunset and before sunrise after making preparation for causing, hurt, assault, wrongful restraint or fear of hurt or of assault or wrongful restraint than punishable with imprisonment of fourteen years and fine. (7) if committing lurking house-trespass or house breaking causing grievous hurt or attempts to cause death or grievous hurt than punishable with imprisonment for life, or imprisonment for either description which may extend to ten years and fine. (8) if committing lurking house-trespass or house breaking after sunset and before sunrise causing grievous hurt or attempts to cause death or grievous hurt than punishable with imprisonment for life, or imprisonment for either description which may extend to ten years and fine.", 
        "Section in IPC":"S.453- S.460"
    },

    {
        "Section in BNS":"Sec.332",
        "Description": "House-trespass in order to commit offence. Cognizable offence (a) if offence is punishable with death than punishable with imprisonment for life, or with rigorous imprisonment for either description which may extend to ten years and fine. (b) if offence is punishable with imprisonment for life, shall be punished with imprisonment of either description which may extend to two years and fine. (c) if offence is punishable with imprisonment shall be punished with imprisonment of either description which may extend to two years and fine.",
        "Section in IPC":"S.449-S.451"
    },

    {
        "Section in BNS":"Sec.333 ",
        "Description": "House-trespass after preparation for hurt, assault or wrongful restraint. Cognizable offence  Punishable with imprisonment for seven years and fine.",
        "Section in IPC":"S. 452"
    },
    {
        "Section in BNS":"Sec.334 (1) & (2)",
        "Description": "Dishonestly breaking open receptacle containing property Cognizable offence (1) Punishable with imprisonment for two years or with fine or with both. (2) If interested with any closed receptacle without having authority to open than Punishable with imprisonment for three years or with fine or with both.",
        "Section in IPC":"S.461-S.462"
    },
    {
        "Section in BNS":"Sec.335",
        "Description": "Making a false document",
        "Section in IPC":"S.464"
    },
    {
        "Section in BNS":"Sec.336 (1) to (4)",
        "Description": "Forgery Non Cognizable (2) Punishable with imprisonment for two years or fine or both. Cognizable offence (3) If forgery is for the purpose of cheating then punishable with imprisonment which may extend to seven years and fine. (4) If forgery harms reputation of any party then punishable with imprisonment which may extend to three years and fine.",
        "Section in IPC":"S.463 S.465 S.468 S.469"
    },
    {
        "Section in BNS":"Sec.337 ",
        "Description": "Forgery of record of Court or of public register, etc. Non Cognizable Punishable with imprisonment for seven years and fine.",
        "Section in IPC":"S.466"
    },
    {
    
         "Section in BNS":"Sec.338",
        "Description": "Forgery of valuable security, will, etc. or authority to make or transfer any valuable security or to receive any money etc. Non Cognizable Punishable with imprisonment for life or imprisonment for ten years and fine Cognizable offence When the valuable security is a promissory note of the Central Government Punishable with imprisonment for life or imprisonment for ten years and fine",
        "Section in IPC":"S. 467"
    },
      
    {
        "Section in BNS":"Sec.339 ",
        "Description": "Having possession of document described in section 337 or section 338, knowing it to be forged and intending to use it as genuine. Cognizable offence If document is one of the descriptions mentioned in section 337. Punishable with imprisonment for seven years and fine Non cognizable If document is as one of the descriptions given in section 338, Punishable with imprisonment for life and imprisonment for seven years and fine. ",
        "Section in IPC":"S. 474"
    },

    {
        "Section in BNS":"Sec.340 (1) & (2)",
        "Description": "Forged document or electronic record and using it as genuine. Cognizable offence (2) Punishable with punishment as given for forgery of such document.",
        "Section in IPC":"S.470-S.471"
    },

    {
        "Section in BNS":"Sec.341 (1) to (4)",
        "Description": "Making or possessing counterfeit seal, etc., with intent to commit forgery punishable under section 338. Cognizable offence (1) if makes or counterfeits any seal, plate or other instrument for committing any forgery punishable under section 338 than punishable with imprisonment for life or with imprisonment of either description which may extend to seven years and fine. (2) if makes or counterfeits any seal, plate or other instrument for committing any forgery punishable other than under section 338 then punishable with imprisonment of either description which may extend to seven years and fine. (3) if posses any seal, plate or other instrument knowing the same to be counterfeited than punishable with imprisonment of either description which may extend to three years and fine. (4) if uses any seal, plate or other instrument knowingly which are counterfeit than punishable with imprisonment in the same manner as if he had made or counterfeited.",
        "Section in IPC":"S.472-S.473"
    },

    {
        "Section in BNS":"Sec.342 (1) & (2)",
        "Description": "Counterfeiting device or mark used for authenticating documents described in section 338, or possessing counterfeit marked material. Non Cognizable (1) If counterfeits documents described in section 338 then Punishable with imprisonment for life, or imprisonment for either description for a term which may extend to seven years and fine. (2) If counterfeits documents other then section 338 then Punishable with imprisonment for seven years and fine",
        "Section in IPC":"S.475-S.476"
    },

    {
        "Section in BNS":"Sec.343",
        "Description": "Fraudulent cancellation, destruction, etc., of will, authority to adopt, or valuable security. Non Cognizable Punishable with imprisonment for life, or imprisonment for seven years and fine.",
        "Section in IPC":"S. 477"
    },

    {
        "Section in BNS":"Sec.344",
        "Description": "Falsification of accounts. Non Cognizable Punishable with imprisonment for seven years, or fine, or both.",
        "Section in IPC":"S.477 A"
    },

    {
        "Section in BNS":"Sec.345(1) - (3)",
        "Description": "Property mark Non Cognizable Punishable with imprisonment for one year, or fine or both.",
        "Section in IPC":"S.479, S.481, S.482"
    },

    {
        "Section in BNS":"Sec.346",
        "Description": "Tampering with property mark with intent to cause injury. Non Cognizable Punishable with imprisonment for one year, or fine or both.",
        "Section in IPC":"S.489"
    },

    {
        "Section in BNS":"Sec. 347(1) &(2)",
        "Description": "Counterfeiting a property mark. Non Cognizable (1 & 2 ) Punishable with imprisonment ranging from two years to three years and fine etc.",
        "Section in IPC":"S.483,S.484"
    },

    {
        "Section in BNS":"Sec.348",
        "Description": "Making or possession of any instrument for counterfeiting a property mark. Non Cognizable Punishable with imprisonment for three years, or fine, or both.",
        "Section in IPC":"S.485"
    },

    {
        "Section in BNS":"Sec.349",
        "Description": "Selling goods marked with a counterfeit property mark. Non Cognizable Punishable with imprisonment for one year, or fine, or both.",
        "Section in IPC":"S.486"
    },
    {
        "Section in BNS":"Sec.350 (1) & (2)",
        "Description": "Making a false mark upon any receptacle containing goods. Non Cognizable Punishable with imprisonment for three years, or fine, or both.",
        "Section in IPC":"S.487-S.488"
    },
    {
        "Section in BNS":"Sec.351 (1) to (4)",
        "Description": "Criminal intimidation Non Cognizable (2) if commits criminal intimidation than punishable with imprisonment of either description which may extend to two years, or with fine, or with both. (3) if commits criminal intimidation by threatening to cause death or grievous hurt or destruction of property by fire etc than punishable with imprisonment of either description which may extend to seven years and if he impute unchastely to a woman than punishable with imprisonment of either description which may extend to seven years or with fine or with both. (4) if commits criminal intimidation by anonymous communication etc than punishable with imprisonment of either description which may extend to two years, in addition to the offence provided under sub section (1).",
        "Section in IPC":"S.503, S.506-S.507"
    },

    {
        "Section in BNS":"Sec.352",
        "Description": "Intentional insult with intent to provoke breach of peace. Non Cognizable Punishable with imprisonment for two years, or fine, or both.",
        "Section in IPC":"S.504"
    },

    {
        "Section in BNS":"Sec.353 (1) to (3)",
        "Description": "Statements conducing to public mischief. Non Cognizable Punishable with imprisonment for three years, or fine, or both.Cognizable offence (2) if it contains false information, rumors or alarming news etc. which is likely to create or promote on grounds of religion, race, place of birth etc feelings of enmity/hatred etc than punishable with imprisonment of either description which may extend to three years, or with fine, or with both. (3) if commits offence of clause (2) in place of worship or religious ceremonies etc. than punishable with imprisonment which may extend to five years and fine.",
        "Section in IPC":"S.505"
    },

    {
        "Section in BNS":"Sec.354",
        "Description": "Act caused by inducing person to believe that he will be rendered an object of Divine displeasure. Non Cognizable Punishable with imprisonment for one year, or fine, or both.",
        "Section in IPC":"S.508"
    },
    {
        "Section in BNS":"Sec.355",
        "Description": "Misconduct in public by a drunken person. Non Cognizable Punishable with simple imprisonment for twenty four hours, or fine of one thousand rupees, or both, or with community service. Note: Fine increased",
        "Section in IPC":"S.510"
    },

    {
        "Section in BNS":"Sec.356(1) to (4)",
        "Description": "Defamation Non Cognizable Clause (2 to 4) Punishable with simple imprisonment for two years or fine or both or community service",
        "Section in IPC":"S.499-S.502"
    },

    {
        "Section in BNS":"Sec.357 ",
        "Description": "Breach of contract to attend on and supply wants of helpless person. Non Cognizable Punishable with imprisonment for three months, or fine of five thousand rupees, or both.",
        "Section in IPC":"S.491"
    },

    {
        "Section in BNS":"Sec. 358",
        "Description": "Repeal and savings The Indian Penal code is hereby repealed",
        "Section in IPC":""
    },
    
    {
        "new_section": "8(5)",
        "punishment": "amount of fine, liability in default of payment of fine or in default of community service,(c) - 1 year",
        "old_section_with_punishment": "67-(c)-six months"
    },
    {
        "new_section": "57",
        "punishment": "Abetting commission of offence by public or by more than ten persons, -imprisonment of either description which may extend to seven years and with fine",
        "old_section_with_punishment": "117- 3 years, or with fine, or both"
    },
    {
        "new_section": "99",
        "punishment": "shall not be less than seven years but may extend to 14 years",
        "old_section_with_punishment": "373- may extend to 10 years"
    },
    {
        "new_section": "104",
        "punishment": "punishable with death or with imprisonment for life, which shall mean the remainder of that persons natural life",
        "old_section_with_punishment": "303- punished with death"
    },
    {
        "new_section": "105",
        "punishment": " a term which may extend to 10 years and with fine",
        "old_section_with_punishment": "304-term which may extend to 10 years, or fine, or both"
    },
    {
        "new_section": "106(1)",
        "punishment": "may extend to 2 years for medical- practitioner , may extend to 5 years for others , and shall also be liable to fine 106(2) may extend to ten years and shall also liable to fine",
        "old_section_with_punishment": "304A- may extend to 2 years, or with fine, or both"
    },
    {
        "new_section": "109(2)",
        "punishment": "punished with death or imprisonment for life, which shall mean the remainder of that person’s natural life.",
        "old_section_with_punishment": "307(2)- punished with death"
    },
    {
        "new_section": " 121(1)",
        "punishment": " voluntary causing hurt or grievous hurt to deter public servant from his duty- may extend to 5 years",
        "old_section_with_punishment": "332- which may extend to 3 years"
    },
    {
        "new_section": "122(2)",
        "punishment": "voluntary causing hurt or grievous hurt on provocation- may extend to 5 years",
        "old_section_with_punishment": "335- may extend to four years"
    },
    {
        "new_section": "125(b)",
        "punishment": "an act endangering life and personal safety of others where grievous hurt is causedmay extend to 3 years",
        "old_section_with_punishment": "338- may extend to 2 years"
    },
    {
        "new_section": "127(3)",
        "punishment": "wrongful confinement for three days or more-may extend to 3 years",
        "old_section_with_punishment": "343- may extend to 2 years"
    },
    {
        "new_section": "127(4)",
        "punishment": " wrongful confinement for ten days or more-may extend to 5 years",
        "old_section_with_punishment": "344- may extend to 3 years"
    },
    {
        "new_section": "127(6)",
        "punishment": "wrongful confinement from any person interested in person or from any public servant- may extend to 3 years",
        "old_section_with_punishment": "346- may extend to 2 years"
    },
    {
        "new_section": "144(1)",
        "punishment": "exploitation of a trafficked child for engaging such child for sexual exploitation- 10 years",
        "old_section_with_punishment": "370A(1)- 7 years"
    },
    {
        "new_section": " 144(2)",
        "punishment": "exploitation of trafficked person to engage such person for sexual exploitation- 7 years",
        "old_section_with_punishment": "370A(2)- 5 years"
    },
    {
        "new_section": "166",
        "punishment": "abetment of act of insubordination by soldier, sailor and airman- 2 years",
        "old_section_with_punishment": "138- 6 months"
    },
    {
        "new_section": "191(3)",
        "punishment": "rioting armed with a deadly weapon to cause death etc- 5 years",
        "old_section_with_punishment": "148(3)- 3 years"
    },
    {
        "new_section": " 217",
        "punishment": "false information with intent to cause public servant use his lawful power to injury of another person- 1 year",
        "old_section_with_punishment": "182- 6 months"
    },
    {
        "new_section": "223(a)",
        "punishment": "disobedience to order duly promulgated by public servant to cause obstruction etc. 6 months",
        "old_section_with_punishment": "188(a)- 1 month"
    },
    {
        "new_section": "223(b)",
        "punishment": "disobedience to order duly promulgated by public servant to cause danger to human life etc.-1 year",
        "old_section_with_punishment": "188(b)- 6 months"
    },
    {
        "new_section": "241",
        "punishment": "destruciotn of document or electronic record to prevent its production as evidence- 3 years",
        "old_section_with_punishment": "204- 2 years"
    },
    {
        "new_section": "243",
        "punishment": " fraudulent removal or concealment of property to prevent its seizure as forfeited or in execution-3 years",
        "old_section_with_punishment": "206- 2 years"
    },
    {
        "new_section": "248(a)",
        "punishment": "-false charge of offence made with intent to injure- 5 years",
        "old_section_with_punishment": "211(a)- 2 years"
    },
    {
        "new_section": "248(b)",
        "punishment": "whenever no criminal proceeding is instituted -10 years",
        "old_section_with_punishment": " 211(b)- 7 years"
    },
    {
        "new_section": "276",
        "punishment": "adulteration of drugs-1 year",
        "old_section_with_punishment": "274- 6 months"
    },
    {
        "new_section": "279",
        "punishment": "fouling water of public spring or reservoir- 6 months",
        "old_section_with_punishment": "277- 3 months"
    },
    {
        "new_section": "316(2)",
        "punishment": "commits criminal breach of trust -5 years",
        "old_section_with_punishment": "406- 3 years"
    },
    {
        "new_section": "318(2)",
        "punishment": "whoever cheats -3 years",
        "old_section_with_punishment": "417- 1 year"
    },
    {
        "new_section": "318(3)",
        "punishment": " whoever cheats with the knowledge to cause wrongful loss-5 years",
        "old_section_with_punishment": "418- 3 years"
    },
    {
        "new_section": "322",
        "punishment": "dishonest or fraudulent execution of deed of transfer containing false statement of consideration-3 years",
        "old_section_with_punishment": "423- 2 years"
    },
    {
        "new_section": "323",
        "punishment": "dishonest or fraudulent removal or concealment of property- 3 years",
        "old_section_with_punishment": "424- 2 years"
    },
    {
        "new_section": "324(2)",
        "punishment": "whoever commits mischief 6 months",
        "old_section_with_punishment": "426- 3 months"
    },
    {
        "new_section": "325",
        "punishment": "mischief by killing or maiming animal-5 years",
        "old_section_with_punishment": "428- 2 years"
    },
    {
        "new_section": "Amount of fine, liability in default of payment of fine etc 8(5)(a)",
        "enhanced_fine": " In default of fine not exceeding Rs.5000, Imprisonment of two months",
        "old_section_and_fine": " 67- (a)- 50 rupees"
    },
    {
        "new_section": "Amount of fine, liability in default of payment of fine etc 8(5)(b)",
        "enhanced_fine": " In default of fine not exceeding Rs.10000, Imprisonment of four months",
        "old_section_and_fine": " 67- (b)- 100 rupees"
    },
    {
        "new_section": "115(2)",
        "enhanced_fine": "Voluntary causing hurt, fine of 10,000 rupees",
        "old_section_and_fine": "323- 1000 rupees"
    },
    {
        "new_section": "118(1)",
        "enhanced_fine": "Voluntary causing hurt or grievous hurt by dangerous weapons or means, fine which may extend to twenty thousand rupees",
        "old_section_and_fine": "324- or with fine"
    },
    {
        "new_section": "122(1)",
        "enhanced_fine": "Voluntary causing hurt on provocation - 5000 rupees",
        "old_section_and_fine": "334- 500 rupees"
    },
    {
        "new_section": "122(2)",
        "enhanced_fine": "Voluntary causing grievous hurt by provocation, 10,000 rupees",
        "old_section_and_fine": "335- 2000 rupees"
    },
    {
        "new_section": "125",
        "enhanced_fine": "Act endangering life or personal safety of others 2,500 rupees",
        "old_section_and_fine": "336- 250 rupees"
    },
    {
        "new_section": "125(a)",
        "enhanced_fine": "Act endangering life or personal safety of others where hurt is caused --5000 rupees",
        "old_section_and_fine": "337- 500 rupees"
    },
    {
        "new_section": "125(b)",
        "enhanced_fine": "Act endangering life or personal safety of others where grievous hut is caused -- 10,000 rupees",
        "old_section_and_fine": "338- 1000 rupees"
    },
    {
        "new_section": "126(2)",
        "enhanced_fine": "wrongful restraint - 5000 rupees",
        "old_section_and_fine": "341- 500 rupees"
    },
    {
        "new_section": "127(2)",
        "enhanced_fine": "wrongful confinement --5000 rupees",
        "old_section_and_fine": "342- 1000 rupees"
    },
    {
        "new_section": "127(3)",
        "enhanced_fine": "wrongfully confined for 3 days or more --10,000 rupees",
        "old_section_and_fine": "343- or with fine"
    },
    {
        "new_section": "127(4)",
        "enhanced_fine": "wrongfully confined for 10 days or more shall also be liable to fine which shall not be less than 10,000 rupees",
        "old_section_and_fine": "345- shall also be liable to fine"
    },
    {
        "new_section": "127(5)",
        "enhanced_fine": "wrongfully confined knowing that a writ for liberation has been issued –shall also be liable to fine",
        "old_section_and_fine": "345, Nil fine"
    },
    {
        "new_section": "127(6)",
        "enhanced_fine": "wrongfully confined so that his confinement may not known to any person interested in that person or any public servant --shall also be liable to fine",
        "old_section_and_fine": "346 – Nil Fine"
    },
    {
        "new_section": "131",
        "enhanced_fine": "punishment for assault and criminal force otherwise than grave provocation 1000 rupees",
        "old_section_and_fine": "352- 500 rupees"
    },
    {
        "new_section": "135",
        "enhanced_fine": "assault or criminal force in attempt to wrongfully confine a person -5000 rupees",
        "old_section_and_fine": "357- 1000 rupees"
    },
    {
        "new_section": "136",
        "enhanced_fine": "assault or criminal force on grave provocation-1000 rupees",
        "old_section_and_fine": "358- 200 rupees"
    },
    {
        "new_section": "165",
        "enhanced_fine": "desserter concealed on board merchant vessel through negligence of master- 3000 rupees",
        "old_section_and_fine": "137- 500 rupees"
    },
    {
        "new_section": "168",
        "enhanced_fine": "wearing garb or carrying token used by soldier, sailor or airman- 2000 rupees",
        "old_section_and_fine": "140- 500 rupees"
    },
    {
        "new_section": "176",
        "enhanced_fine": "illegal payments in c/w election- 10,000 rupees",
        "old_section_and_fine": "171H- 500 rupees"
    },
    {
        "new_section": "177",
        "enhanced_fine": "failiure to keep election accounts- 5000 rupees",
        "old_section_and_fine": "171I- 500 rupees"
    },
    {
        "new_section": "182(1)",
        "enhanced_fine": "making or using documents resembling currency or bank notes-300 rupees",
        "old_section_and_fine": "489E(1)- 100 rupees"
    },
    {
        "new_section": "182(2)",
        "enhanced_fine": " a person whose name appears on a document the making of which is an offence refuses to disclose to a police officer on being so required the name and add of the person by whom it was printed or otherwise. - 600 rupees",
        "old_section_and_fine": "489E(2)- 200 rupees"
    },
    {
        "new_section": "194(2)",
        "enhanced_fine": "affray 1000 rupees",
        "old_section_and_fine": "160- 100 rupees"
    },
    {
        "new_section": "195(1)",
        "enhanced_fine": " assaulting or obstructing a public servant when suppressing a riot etc. shall not be less than 25,000 rupees.",
        "old_section_and_fine": "152- with fine."
    },
    {
        "new_section": "205",
        "enhanced_fine": "wearing garb or carrying token used by public servant with fraudulent intent -5000 rupees",
        "old_section_and_fine": " 171- 200 rupees"
    },
    {
        "new_section": "206(a)",
        "enhanced_fine": "absconding to avoid service of summons or their proceedings issued by public servants- 5000 rupees",
        "old_section_and_fine": "172(a)- 500 rupees"
    },
    {
        "new_section": "206(b)",
        "enhanced_fine": "absconding to avoid service of summons or their proceedings issued by Court- 10,000 rupees",
        "old_section_and_fine": "172(b)- 1000 rupees"
    },
    {
        "new_section": "207(a)",
        "enhanced_fine": "preventing service or summons or other proceedings or preventing publication thereof issued by public servant-5000 rupees",
        "old_section_and_fine": "173(a)- 500 rupees"
    },
    {
        "new_section": "207(b)",
        "enhanced_fine": "preventing service or summons or other proceedings or preventing publication thereof issued by court- 10,000 rupees",
        "old_section_and_fine": "173(b)- 1,000 rupees"
    },
    {
        "new_section": "208(a)",
        "enhanced_fine": "-Non attendance in obedience to an order before public servant -5000 rupees",
        "old_section_and_fine": " 174(a)- 500 rupees"
    },
    {
        "new_section": "208(b)",
        "enhanced_fine": "Non attendance in obedience to an order before court -10,000 rupees",
        "old_section_and_fine": "174(b)- 1000 rupees"
    },
    {
        "new_section": "210(a)",
        "enhanced_fine": "omission to produce document or electronic record to public servant by person legally bound to produce it-5000 rupees",
        "old_section_and_fine": "175(a)- 500 rupees"
    },
    {
        "new_section": " 210(b)",
        "enhanced_fine": "omission to produce document or electronic record to public servant by person legally bound to produce before court-10,000 rupees",
        "old_section_and_fine": "175(b)- 1,000 rupees"
    },
    {
        "new_section": "211(a)",
        "enhanced_fine": "omission to give notice or information to public servant by person legally bound to give it- 5000 rupees",
        "old_section_and_fine": "176(a)- 500 rupees"
    },
    {
        "new_section": "211(b)",
        "enhanced_fine": "omission to give notice or information to public servant by person legally bound to give it regarding commission of offence or prevention or apprehension of offender of an offence- 10,000 rupees",
        "old_section_and_fine": "176(b)- 1000 rupees"
    },
    {
        "new_section": "212(a)",
        "enhanced_fine": "furnishing false information to public servant- 5000 rupees",
        "old_section_and_fine": "177- 1000 rupees"
    },
    {
        "new_section": "213",
        "enhanced_fine": "refusing oath or affirmation when duly required by public servant to make it- 5000 rupees",
        "old_section_and_fine": "178- 1000 rupees"
    },
    {
        "new_section": "214",
        "enhanced_fine": "refusing to answer-5000 rupees",
        "old_section_and_fine": "179- 1000 rupees"
    },
    {
        "new_section": "215",
        "enhanced_fine": "refusing to sign statement- 3,000 rupees",
        "old_section_and_fine": "180- 500 rupees"
    },
    {
        "new_section": "217",
        "enhanced_fine": "false information with intent to cause public servant to use his lawful power to injury to another person- 10,000 rupees",
        "old_section_and_fine": "182- 1000 rupees"
    },
    {
        "new_section": "218",
        "enhanced_fine": "resistance to taking of property by lawful authority of a public servant-10,000 rupees",
        "old_section_and_fine": "183- 1000 rupees"
    },
    {
        "new_section": "219",
        "enhanced_fine": "obstructing sale of property occurred for sale by authority of public servant-5,000 rupees",
        "old_section_and_fine": "184- 500 rupees"
    },
    {
        "new_section": "221",
        "enhanced_fine": "obstrucitng public servant in discharge of public functions- 2,500 rupees",
        "old_section_and_fine": "186- 500 rupees"
    },
    {
        "new_section": "222(a)",
        "enhanced_fine": "omission to assist public servant when bound by law to give assistance -2,500 rupees",
        "old_section_and_fine": " 187(a)- 200 rupees"
    },
    {
        "new_section": "222(b)",
        "enhanced_fine": "omission to assist public servant when bound by law to give assistance for the purpose of executing any process lawfully issued by a court for preventing of certain offences- 5,000 rupees",
        "old_section_and_fine": "187(b)- 500 rupees"
    },
    {
        "new_section": "223(a)",
        "enhanced_fine": "disobedience to order duly promulgated by public servant where such disobedience cause obstruction etc.- 2,500 rupees",
        "old_section_and_fine": "188(a)- 200 rupees"
    },
    {
        "new_section": "223(b)",
        "enhanced_fine": "disobedience to order duly promulgated by public servant where such disobedience danger to human life etc.- 5,000 rupees",
        "old_section_and_fine": " 188(b)- 1000 rupees"
    },
    {
        "new_section": "229(1)",
        "enhanced_fine": "punishment for false evidence in an any stage of a judicial proceedings etc.-liable to fine which may extend to 10,000 rupees",
        "old_section_and_fine": "193(1)- liable to fine"
    },
    {
        "new_section": "229(2)",
        "enhanced_fine": "punishment for false evidence other than judicial proceedings etc -liable to fine which may extend to 5,000rupees",
        "old_section_and_fine": " 193(2)- liable to fine"
    },
    {
        "new_section": "230(1)",
        "enhanced_fine": "giving or fabricating false evidence with intent to procure capital offences- liable to fine which may extend to 50,000 rupees",
        "old_section_and_fine": "194(1)- liable to fine"
    },
    {
        "new_section": "239",
        "enhanced_fine": "intentional omission to give information of offence by person bound to inform- or with fine which may extend to 5000 rupees",
        "old_section_and_fine": "237- or with fine"
    },
    {
        "new_section": "241",
        "enhanced_fine": "destruciton of evidence or electronic record to prevent its production as evidence- or with fine which may extend to 5000 rupees",
        "old_section_and_fine": "239- or with fine"
    },
    {
        "new_section": "243",
        "enhanced_fine": "fraudulent removal or concealment of property to prevent its seizure as forfeited or in execution- or with fine which may extend to 5000 rupees",
        "old_section_and_fine": "241- or with fine"
    },
    {
        "new_section": "248",
        "enhanced_fine": "false charge of offence made with intent to injure-or with fine which may extend to two lakh rupees",
        "old_section_and_fine": "211- or with fine"
    },
    {
        "new_section": "267",
        "enhanced_fine": "intentinal insult or interruption to public servant seating in judicial proceeding- 5000 rupees",
        "old_section_and_fine": "228- 1000 rupees"
    },
    {
        "new_section": "274",
        "enhanced_fine": "adulteration of food or drink intended for sale- 5000 rupees",
        "old_section_and_fine": " 272- 1000 rupees"
    },
    {
        "new_section": "275",
        "enhanced_fine": "sale of noxious food or drink- 5000 rupees",
        "old_section_and_fine": "273- 1000 rupees"
    },
    {
        "new_section": "276",
        "enhanced_fine": "adultration of drugs- 5000 rupees",
        "old_section_and_fine": "274- 1000 rupees"
    },
    {
        "new_section": "277",
        "enhanced_fine": "sale of adulterated drugs-5000 rupees",
        "old_section_and_fine": "275- 1000 rupees"
    },
    {
        "new_section": "278",
        "enhanced_fine": "sale of drug as a different drug or prepration- 5000 rupees",
        "old_section_and_fine": "276- 1000 rupees"
    },
    {
        "new_section": "279",
        "enhanced_fine": "fouling water of public spring or reservoir -5000 rupee",
        "old_section_and_fine": "277- 500 rupees "
    },
    {
        "new_section": "280",
        "enhanced_fine": "making atmosphere noxious to health-1000 rupees",
        "old_section_and_fine": "278- 500 rupees"
    },
    {
        "new_section": "282",
        "enhanced_fine": "rash navigation of vessel- 10,000 rupees",
        "old_section_and_fine": "280- 1000 rupees"
    },
    {
        "new_section": " 283",
        "enhanced_fine": "exhibition of false light mark of buoy- and with fine which shall not be less than 10,000 rupees, or with both",
        "old_section_and_fine": "281- or with fine"
    },
    {
        "new_section": "284",
        "enhanced_fine": "conveying person by water for heir in an unsafe or overloaded vessel-5,000 rupees",
        "old_section_and_fine": "282- 1000 rupees"
    },
    {
        "new_section": "285",
        "enhanced_fine": "danger or obstruction in public way or line of navigation-5000 rupees",
        "old_section_and_fine": "283- 200 rupees"
    },
    {
        "new_section": "286",
        "enhanced_fine": "negligent conduct w.r.t poisonous substance-5,000 rupees",
        "old_section_and_fine": "284- 1000 rupees"
    },
    {
        "new_section": "287",
        "enhanced_fine": "negligent conduct w.r.t fire or combustible matter- 2,000 rupees",
        "old_section_and_fine": "285- 1000 rupees"
    },
    {
        "new_section": "288",
        "enhanced_fine": "negligent conduct w.r.t explosive substance- 5,000 rupees",
        "old_section_and_fine": "286- 1000 rupees"
    },
    {
        "new_section": "289",
        "enhanced_fine": "negligent conduct w.r.t machinery-5,000 rupees",
        "old_section_and_fine": "287- 1000 rupees"
    },
    {
        "new_section": "290",
        "enhanced_fine": "negligent conduct w.r.t cooling down, repairing or constructing building etc. 5,000 rupees",
        "old_section_and_fine": "288- 1000 rupees"
    },
    {
        "new_section": "291",
        "enhanced_fine": "negligent conduct w.r.t animal- 5,000 rupees",
        "old_section_and_fine": "289- 1000 rupees"
    },
    {
        "new_section": "292",
        "enhanced_fine": "punishment for public nuisance in cases not otherwise provided for-1,000 rupees",
        "old_section_and_fine": "290- 200 rupees"
    },
    {
        "new_section": "293",
        "enhanced_fine": "continuance of nuisance after injection to discontinue - or with fine which may extend to 5000 rupees",
        "old_section_and_fine": "291- or with fine"
    },
    {
        "new_section": "294(2)",
        "enhanced_fine": "sale etc. of obscene books etc on first conviction- 5000 rupees",
        "old_section_and_fine": "292(2)- 2000 rupees"
    },
    {
        "new_section": "294(2)",
        "enhanced_fine": "sale etc. of obscene books etc on second subsequent conviction- 10,000 rupees (second time)",
        "old_section_and_fine": "292(2) 5000 rupees"
    },
    {
        "new_section": "296",
        "enhanced_fine": "obscene acts and songs- or with fine which may extend to 1000 rupees",
        "old_section_and_fine": "294- or with fine"
    },
    {
        "new_section": "297(2)",
        "enhanced_fine": "keeping lottery office/publishes any proposal to pay and sum etc.- 5000 rupees",
        "old_section_and_fine": "294A- 1000 rupees"
    },
    {
        "new_section": "329(3)",
        "enhanced_fine": "commits criminal tress pass- 5000 rupees",
        "old_section_and_fine": "447- 500 rupees"
    },
    {
        "new_section": "329(4)",
        "enhanced_fine": "commits house tress pass- 5000 rupees",
        "old_section_and_fine": "448- 1000 rupees"
    },
    {
        "new_section": "355",
        "enhanced_fine": "miscondcut in public by a drunken person- 1000 rupees",
        "old_section_and_fine": "510- 10 rupees"
    },

    
    {
        "section": "Sec. 99",
        "Heading": "Buying Child for Purposes of Prostitution, etc",
        "minimum_punishment": "shall not be less than seven years"
        },
        {
        "section": "Sec. 105",
        "Heading": "Punishment For Culpable Homicide Not Amounting to Murder.",
        "minimum_punishment": " shall not be less than five years"
         },
         {
        "section": "Sec. 111(2) (b)",
        "Heading": "Organised Crime.",
        "minimum_punishment": "or a term which shall not be less than five years but which may extend to imprisonment for life, and shall also be liable to fine which shall not be less than five lakh rupees"
         },
         {
        "section": "Sec. 111(3)",
        "Heading": "Abetting, attempting etc. of an Organised Crime.",
        "minimum_punishment": "which shall not be less than five years and shall also be liable to fine which shall not be less than five lakh rupees"
        },
        {
        "section": "Sec. 111(4)",
        "Heading": "Being a member of Organised Crime",
        "minimum_punishment": "shall not be less than five years"
        },
        {
        "section": "Sec. 111(5)",
        "Heading": "",
        "minimum_punishment": "shall not be less than three years and shall also be liable to fine which shall not be less than five lakh rupees"
        },  
        {
        "section": "Sec. 111 (6)",
        "Heading": " Possessing property derived from Organised Crime.",
        "minimum_punishment": "shall not be less than three years and shall also be liable to fine which shall not be less than two lakh rupees"
        }, 
        {
        "section": "Sec.111 (7)",
        "Heading": "Possession of property on behalf of member of Organised Crime.",
        "minimum_punishment": " shall not be less than three years and shall also be liable to fine which shall not be less than one lakh rupees"
        },
        {
        "section": "Sec. 112 (2)",
        "Heading": "Petty Organised Crime",
        "minimum_punishment": "shall not be less than one year but which may extend to seven years, and shall also be liable to fine"
        },
        {
        "section": "Sec. 113 (2) (b)",
        "Heading": "Terrorist Act.",
        "minimum_punishment": "which shall not be less than five years."
        },
        {
        "section": "Sec. 113(3)",
        "Heading": "Abetting, attempting etc. of Terrorist Act.",
        "minimum_punishment": "Shall not be less than five years"
        },
        {
        "section": "Sec. 113(4)",
        "Heading": "Organising a camp for Terrorist Act.",
        "minimum_punishment": "shall not be less than five years"
        },
        {
        "section": "Sec. 113(6)",
        "Heading": " Harboring any person who has committed any terrorist Act.",
        "minimum_punishment": "which shall not be less than three years"
        },
        {
        "section": "Sec. 117(3)",
        "Heading": "Voluntarily Causing Grievous Hurt resulting in permanent vegetative state",
        "minimum_punishment": "which shall not be less than ten years"
        },
        {
        "section": "Sec. 118(2)",
        "Heading": "Voluntarily Causing Hurt or Grievous Hurt by Dangerous Weapons or Means.",
        "minimum_punishment": "shall not be less than one year"
        },
        {
        "section": "Sec. 121(2)",
        "Heading": "Voluntarily Causing Hurt or Grievous Hurt to Deter Public Servant from His Duty.",
        "minimum_punishment": "shall not be less than one year"
        },
        {
        "section": "Sec. 139(1)",
        "Heading": "Kidnapping or Maiming a Child for Purposes of Begging.",
        "minimum_punishment": "shall not be less than ten years"
        },
        {
        "section": "Sec. 139(2)",
        "Heading": "Kidnapping or Maiming a Child for Purposes of Begging.",
        "minimum_punishment": " shall not be less than twenty years"
        },
        {
        "section": "Sec. 204",
        "Heading": " Personating A Public Servant",
        "minimum_punishment": " shall not be less than six months"
        },
        {
        "section": "Sec. 303(2)",
        "Heading": "Theft.",
        "minimum_punishment": "shall not be less than one year"
        },
        {
        "section": "Sec. 310(3)",
        "Heading": "Dacoity",
        "minimum_punishment": "shall not be less than ten years"
        },
        {
        "section": "Sec. 314",
        "Heading": "Dishonest Misappropriation of Property",
        "minimum_punishment": "shall not be less than six months"
        },
        {
        "section": "Sec. 320",
        "Heading": "Dishonest or Fraudulent Removal or Concealment of Property To Prevent Distribution Among Creditors",
        "minimum_punishment": "shall not be less than six months"
        }    
]